import json
import random
import re

import hazm
import jdatetime
import jsonlines
import polars as pl
import requests

str_to_symbol = {'آباد': '#آباد', 'آبادا': '#آبادا', 'آپ': '#آپ', 'آسیا': '#آسیا', 'اپال': '#اپال', 'اتکام': '#اتکام',
                 'اخابر': '#اخابر', 'اردستان': '#اردستان', 'اسیاتک': '#اسیاتک', 'افق': '#افق', 'البرز': '#البرز',
                 'امید': '#امید', 'امین': '#امین', 'انرژی': '#انرژی', 'بالبر': '#بالبر', 'بترانس': '#بترانس',
                 'برکت': '#برکت', 'بسویچ': '#بسویچ', 'بشهاب': '#بشهاب', 'بفجر': '#بفجر', 'بکاب': '#بکاب',
                 'بکام': '#بکام', 'بموتو': '#بموتو', 'بنیرو': '#بنیرو', 'بورس': '#بورس', 'بوعلی': '#بوعلی',
                 'پارس': '#پارس', 'پارسان': '#پارسان', 'پارسیان': '#پارسیان', 'پاسا': '#پاسا', 'پاکشو': '#پاکشو',
                 'پتایر': '#پتایر', 'پترول': '#پترول', 'پدرخش': '#پدرخش', 'پردیس': '#پردیس', 'پسهند': '#پسهند',
                 'پکرمان': '#پکرمان', 'پکویر': '#پکویر', 'پلاسک': '#پلاسک', 'پی پاد': '#پی پاد', 'تاپیکو': '#تاپیکو',
                 'تایرا': '#تایرا', 'تپمپی': '#تپمپی', 'تکاردان': '#تکاردان', 'تکمبا': '#تکمبا', 'تکنو': '#تکنو',
                 'تملت': '#تملت', 'تنوین': '#تنوین', 'تیپیکو': '#تیپیکو', 'ثاخت': '#ثاخت', 'ثامان': '#ثامان',
                 'ثامید': '#ثامید', 'ثبهساز': '#ثبهساز', 'ثشاهد': '#ثشاهد', 'ثشرق': '#ثشرق', 'ثفارس': '#ثفارس',
                 'ثمسکن': '#ثمسکن', 'ثنوسا': '#ثنوسا', 'جم': '#جم', 'جم پیلن': '#جم پیلن', 'چافست': '#چافست',
                 'چدن': '#چدن', 'چفیبر': '#چفیبر', 'چکاپا': '#چکاپا', 'چکارن': '#چکارن', 'چکاوه': '#چکاوه',
                 'حپترو': '#حپترو', 'حتاید': '#حتاید', 'حتوکا': '#حتوکا', 'حفارس': '#حفارس', 'حفاری': '#حفاری',
                 'حکشتی': '#حکشتی', 'خاذین': '#خاذین', 'خاهن': '#خاهن', 'خبهمن': '#خبهمن', 'خپویش': '#خپویش',
                 'ختراک': '#ختراک', 'ختور': '#ختور', 'ختوقا': '#ختوقا', 'خچرخش': '#خچرخش', 'خراسان': '#خراسان',
                 'خریخت': '#خریخت', 'خرینگ': '#خرینگ', 'خزامیا': '#خزامیا', 'خزر': '#خزر', 'خساپا': '#خساپا',
                 'خشرق': '#خشرق', 'خفنر': '#خفنر', 'خکار': '#خکار', 'خکمک': '#خکمک', 'خگستر': '#خگستر', 'خلنت': '#خلنت',
                 'خمحرکه': '#خمحرکه', 'خمحور': '#خمحور', 'خمهر': '#خمهر', 'خنصیر': '#خنصیر', 'خودرو': '#خودرو',
                 'خوساز': '#خوساز', 'دابور': '#دابور', 'داتام': '#داتام', 'دارو': '#دارو', 'داسوه': '#داسوه',
                 'دالبر': '#دالبر', 'دامین': '#دامین', 'دانا': '#دانا', 'دپارس': '#دپارس', 'دتماد': '#دتماد',
                 'دجابر': '#دجابر', 'ددام': '#ددام', 'درازک': '#درازک', 'دروز': '#دروز', 'دزهراوی': '#دزهراوی',
                 'دسبحا': '#دسبحا', 'دسبحان': '#دسبحان', 'دسینا': '#دسینا', 'دشیمی': '#دشیمی', 'دعبید': '#دعبید',
                 'دفارا': '#دفارا', 'دفرا': '#دفرا', 'دکوثر': '#دکوثر', 'دکیمی': '#دکیمی', 'دلر': '#دلر',
                 'دلقما': '#دلقما', 'دیران': '#دیران', 'ذوب': '#ذوب', 'رانفور': '#رانفور', 'رتاپ': '#رتاپ',
                 'رکیش': '#رکیش', 'رمپنا': '#رمپنا', 'زپارس': '#زپارس', 'زکوثر': '#زکوثر', 'زمگسا': '#زمگسا',
                 'سآبیک': '#سآبیک', 'ساراب': '#ساراب', 'ساربیل': '#ساربیل', 'ساروم': '#ساروم', 'سبجنو': '#سبجنو',
                 'سبهان': '#سبهان', 'سپ': '#سپ', 'سپاها': '#سپاها', 'سپید': '#سپید', 'ستران': '#ستران', 'سخاش': '#سخاش',
                 'سخزر': '#سخزر', 'سخوز': '#سخوز', 'سدشت': '#سدشت', 'سدور': '#سدور', 'سرود': '#سرود', 'سشرق': '#سشرق',
                 'سشمال': '#سشمال', 'سصفها': '#سصفها', 'سصوفی': '#سصوفی', 'سغرب': '#سغرب', 'سفار': '#سفار',
                 'سفارس': '#سفارس', 'سفانو': '#سفانو', 'سقاین': '#سقاین', 'سکرد': '#سکرد', 'سکرما': '#سکرما',
                 'سمازن': '#سمازن', 'سنیر': '#سنیر', 'سهرمز': '#سهرمز', 'سهگمت': '#سهگمت', 'سیتا': '#سیتا',
                 'سیدکو': '#سیدکو', 'سیستم': '#سیستم', 'سیلام': '#سیلام', 'سیمرغ': '#سیمرغ', 'شاراک': '#شاراک',
                 'شاملا': '#شاملا', 'شبریز': '#شبریز', 'شبندر': '#شبندر', 'شبهرن': '#شبهرن', 'شپارس': '#شپارس',
                 'شپاکسا': '#شپاکسا', 'شپدیس': '#شپدیس', 'شپنا': '#شپنا', 'شتران': '#شتران', 'شخارک': '#شخارک',
                 'شدوص': '#شدوص', 'شراز': '#شراز', 'شسپا': '#شسپا', 'شستا': '#شستا', 'شسینا': '#شسینا',
                 'شغدیر': '#شغدیر', 'شفا': '#شفا', 'شفارس': '#شفارس', 'شفن': '#شفن', 'شکربن': '#شکربن', 'شکلر': '#شکلر',
                 'شگل': '#شگل', 'شلعاب': '#شلعاب', 'شنفت': '#شنفت', 'شهر': '#شهر', 'شوینده': '#شوینده',
                 'شیراز': '#شیراز', 'شیران': '#شیران', 'صبا': '#صبا', 'غاذر': '#غاذر', 'غالبر': '#غالبر',
                 'غبشهر': '#غبشهر', 'غبهنوش': '#غبهنوش', 'غپاک': '#غپاک', 'غپینو': '#غپینو', 'غچین': '#غچین',
                 'غدام': '#غدام', 'غدشت': '#غدشت', 'غزر': '#غزر', 'غسالم': '#غسالم', 'غشاذر': '#غشاذر', 'غشان': '#غشان',
                 'غشصفا': '#غشصفا', 'غشهد': '#غشهد', 'غکورش': '#غکورش', 'غگرجی': '#غگرجی', 'غگل': '#غگل',
                 'غمهرا': '#غمهرا', 'غنوش': '#غنوش', 'فاذر': '#فاذر', 'فاراک': '#فاراک', 'فارس': '#فارس',
                 'فاسمین': '#فاسمین', 'فاما': '#فاما', 'فایرا': '#فایرا', 'فباهنر': '#فباهنر', 'فپنتا': '#فپنتا',
                 'فجام': '#فجام', 'فجر': '#فجر', 'فخاس': '#فخاس', 'فخوز': '#فخوز', 'فرآور': '#فرآور', 'فروس': '#فروس',
                 'فسازان': '#فسازان', 'فسبزوار': '#فسبزوار', 'فسپا': '#فسپا', 'فسرب': '#فسرب', 'فلامی': '#فلامی',
                 'فلوله': '#فلوله', 'فمراد': '#فمراد', 'فملی': '#فملی', 'فنوال': '#فنوال', 'فنورد': '#فنورد',
                 'فولاد': '#فولاد', 'فولاژ': '#فولاژ', 'قپیرا': '#قپیرا', 'قثابت': '#قثابت', 'قرن': '#قرن',
                 'قزوین': '#قزوین', 'قشکر': '#قشکر', 'قشهد': '#قشهد', 'قصفها': '#قصفها', 'قلرست': '#قلرست',
                 'قمرو': '#قمرو', 'قنیشا': '#قنیشا', 'قهکمت': '#قهکمت', 'کاذر': '#کاذر', 'کالا': '#کالا',
                 'کاما': '#کاما', 'کاوه': '#کاوه', 'کبافق': '#کبافق', 'کپارس': '#کپارس', 'کپشیر': '#کپشیر',
                 'کترام': '#کترام', 'کچاد': '#کچاد', 'کحافظ': '#کحافظ', 'کخاک': '#کخاک', 'کدما': '#کدما',
                 'کرازی': '#کرازی', 'کرماشا': '#کرماشا', 'کروی': '#کروی', 'کساپا': '#کساپا', 'کساوه': '#کساوه',
                 'کسرا': '#کسرا', 'کسرام': '#کسرام', 'کسعدی': '#کسعدی', 'کطبس': '#کطبس', 'کفپارس': '#کفپارس',
                 'کفرا': '#کفرا', 'کگاز': '#کگاز', 'کگل': '#کگل', 'کلوند': '#کلوند', 'کماسه': '#کماسه',
                 'کمنگنز': '#کمنگنز', 'کنور': '#کنور', 'کهمدا': '#کهمدا', 'کویر': '#کویر', 'کیمیا': '#کیمیا',
                 'کیمیاتک': '#کیمیاتک', 'لابسا': '#لابسا', 'لبوتان': '#لبوتان', 'لپارس': '#لپارس', 'لخزر': '#لخزر',
                 'لسرما': '#لسرما', 'لوتوس': '#لوتوس', 'ما': '#ما', 'مبین': '#مبین', 'مداران': '#مداران', 'ملت': '#ملت',
                 'میدکو': '#میدکو', 'نمرینو': '#نمرینو', 'نوری': '#نوری', 'های وب': '#های وب', 'همراه': '#همراه',
                 'وآذر': '#وآذر', 'وآفری': '#وآفری', 'واتی': '#واتی', 'واعتبار': '#واعتبار', 'والبر': '#والبر',
                 'وامید': '#وامید', 'وایران': '#وایران', 'وبانک': '#وبانک', 'وبشهر': '#وبشهر', 'وبصادر': '#وبصادر',
                 'وبملت': '#وبملت', 'وبهمن': '#وبهمن', 'وبوعلی': '#وبوعلی', 'وبیمه': '#وبیمه', 'وپارس': '#وپارس',
                 'وپاسار': '#وپاسار', 'وپترو': '#وپترو', 'وپخش': '#وپخش', 'وپست': '#وپست', 'وتجارت': '#وتجارت',
                 'وتوس': '#وتوس', 'وتوسم': '#وتوسم', 'وتوشه': '#وتوشه', 'وتوصا': '#وتوصا', 'وتوکا': '#وتوکا',
                 'وخارزم': '#وخارزم', 'وخاور': '#وخاور', 'ورنا': '#ورنا', 'وساپا': '#وساپا', 'وساخت': '#وساخت',
                 'وساربیل': '#وساربیل', 'وساشرقی': '#وساشرقی', 'وساغربی': '#وساغربی', 'وسبوشهر': '#وسبوشهر',
                 'وسپه': '#وسپه', 'وسخراج': '#وسخراج', 'وسخراش': '#وسخراش', 'وسخوز': '#وسخوز', 'وسرضوی': '#وسرضوی',
                 'وسزنجان': '#وسزنجان', 'وسصفا': '#وسصفا', 'وسفارس': '#وسفارس', 'وسقم': '#وسقم', 'وسکاب': '#وسکاب',
                 'وسکرد': '#وسکرد', 'وسکرشا': '#وسکرشا', 'وسکرمان': '#وسکرمان', 'وسکهبو': '#وسکهبو',
                 'وسگلستا': '#وسگلستا', 'وسگیلا': '#وسگیلا', 'وسلرستا': '#وسلرستا', 'وسمازن': '#وسمازن',
                 'وسمرکز': '#وسمرکز', 'وسهرمز': '#وسهرمز', 'وسهمدا': '#وسهمدا', 'وسیزد': '#وسیزد', 'وسیستا': '#وسیستا',
                 'وسیلام': '#وسیلام', 'وسینا': '#وسینا', 'وصنا': '#وصنا', 'وصندوق': '#وصندوق', 'وصنعت': '#وصنعت',
                 'وغدیر': '#وغدیر', 'وکار': '#وکار', 'وکغدیر': '#وکغدیر', 'ولپارس': '#ولپارس', 'ولساپا': '#ولساپا',
                 'ولصنم': '#ولصنم', 'ولغدر': '#ولغدر', 'ولکار': '#ولکار', 'ولملت': '#ولملت', 'ومدیر': '#ومدیر',
                 'ومعادن': '#ومعادن', 'وملی': '#وملی', 'ومهان': '#ومهان', 'ونفت': '#ونفت', 'ونوین': '#ونوین',
                 'ونیرو': '#ونیرو', 'ونیکی': '#ونیکی', 'آ س پ': '#آ س پ', 'آردینه': '#آردینه', 'آریا': '#آریا',
                 'آریان': '#آریان', 'اپرداز': '#اپرداز', 'اتکای': '#اتکای', 'ارفع': '#ارفع', 'اعتلا': '#اعتلا',
                 'افرا': '#افرا', 'انتخاب': '#انتخاب', 'اوان': '#اوان', 'بالاس': '#بالاس', 'بپاس': '#بپاس',
                 'بپیوند': '#بپیوند', 'بجهرم': '#بجهرم', 'بخاور': '#بخاور', 'بزاگرس': '#بزاگرس', 'بساما': '#بساما',
                 'بکابل': '#بکابل', 'بکهنوج': '#بکهنوج', 'بگیلان': '#بگیلان', 'بمپنا': '#بمپنا', 'بمولد': '#بمولد',
                 'بنو': '#بنو', 'بهپاک': '#بهپاک', 'بیوتیک': '#بیوتیک', 'پارتا': '#پارتا', 'پخش': '#پخش',
                 'پیزد': '#پیزد', 'تاپکیش': '#تاپکیش', 'تبرک': '#تبرک', 'تپسی': '#تپسی', 'تجلی': '#تجلی',
                 'تلیسه': '#تلیسه', 'تماوند': '#تماوند', 'توریل': '#توریل', 'توسن': '#توسن', 'ثالوند': '#ثالوند',
                 'ثباغ': '#ثباغ', 'ثپردیس': '#ثپردیس', 'ثتران': '#ثتران', 'ثجنوب': '#ثجنوب', 'ثرود': '#ثرود',
                 'ثعمرا': '#ثعمرا', 'ثغرب': '#ثغرب', 'چخزر': '#چخزر', 'حآسا': '#حآسا', 'حآفرین': '#حآفرین',
                 'حپارسا': '#حپارسا', 'حپرتو': '#حپرتو', 'حخزر': '#حخزر', 'حریل': '#حریل', 'حسیر': '#حسیر',
                 'حسینا': '#حسینا', 'حگهر': '#حگهر', 'خاور': '#خاور', 'خدیزل': '#خدیزل', 'خکرمان': '#خکرمان',
                 'خنور': '#خنور', 'داوه': '#داوه', 'دبالک': '#دبالک', 'دتوزیع': '#دتوزیع', 'دتولید': '#دتولید',
                 'ددانا': '#ددانا', 'درازی': '#درازی', 'درهآور': '#درهآور', 'دسانکو': '#دسانکو', 'دقاضی': '#دقاضی',
                 'دکپسول': '#دکپسول', 'دماوند': '#دماوند', 'رافزا': '#رافزا', 'رنیک': '#رنیک', 'ریشمک': '#ریشمک',
                 'زاگرس': '#زاگرس', 'زبینا': '#زبینا', 'زدشت': '#زدشت', 'زشریف': '#زشریف', 'زشگزا': '#زشگزا',
                 'زفجر': '#زفجر', 'زفکا': '#زفکا', 'زقیام': '#زقیام', 'زکشت': '#زکشت', 'زگلدشت': '#زگلدشت',
                 'زماهان': '#زماهان', 'زملارد': '#زملارد', 'زنگان': '#زنگان', 'ساروج': '#ساروج', 'سامان': '#سامان',
                 'ساوه': '#ساوه', 'ساینا': '#ساینا', 'سبزوا': '#سبزوا', 'سپیدار': '#سپیدار', 'سجام': '#سجام',
                 'سدبیر': '#سدبیر', 'سرچشمه': '#سرچشمه', 'سغدیر': '#سغدیر', 'سمگا': '#سمگا', 'شاروم': '#شاروم',
                 'شاوان': '#شاوان', 'شبصیر': '#شبصیر', 'شپاس': '#شپاس', 'شتوکا': '#شتوکا', 'شجم': '#شجم',
                 'شرانل': '#شرانل', 'شصدف': '#شصدف', 'شفام': '#شفام', 'شکام': '#شکام', 'شگویا': '#شگویا',
                 'شملی': '#شملی', 'عالیس': '#عالیس', 'غپآذر': '#غپآذر', 'غپونه': '#غپونه', 'غدانه': '#غدانه',
                 'غدیس': '#غدیس', 'غشهداب': '#غشهداب', 'غصینو': '#غصینو', 'غفارس': '#غفارس', 'غگلپا': '#غگلپا',
                 'غگلستا': '#غگلستا', 'غگیلا': '#غگیلا', 'غمایه': '#غمایه', 'غمینو': '#غمینو', 'غویتا': '#غویتا',
                 'فالوم': '#فالوم', 'فتوسا': '#فتوسا', 'فجهان': '#فجهان', 'فرابورس': '#فرابورس', 'فرود': '#فرود',
                 'فروژ': '#فروژ', 'فروسیل': '#فروسیل', 'فروی': '#فروی', 'فزر': '#فزر', 'فزرین': '#فزرین',
                 'فسوژ': '#فسوژ', 'فصبا': '#فصبا', 'فغدیر': '#فغدیر', 'فگستر': '#فگستر', 'فن افزار': '#فن افزار',
                 'فنر': '#فنر', 'فولای': '#فولای', 'قاسم': '#قاسم', 'قچار': '#قچار', 'قشیر': '#قشیر',
                 'کاسپین': '#کاسپین', 'کایزد': '#کایزد', 'کپرور': '#کپرور', 'کتوسعه': '#کتوسعه', 'کتوکا': '#کتوکا',
                 'کرمان': '#کرمان', 'کرومیت': '#کرومیت', 'کزغال': '#کزغال', 'کشرق': '#کشرق', 'کگهر': '#کگهر',
                 'کلر': '#کلر', 'کمرجان': '#کمرجان', 'کوثر': '#کوثر', 'کی بی سی': '#کی بی سی', 'گدنا': '#گدنا',
                 'گکوثر': '#گکوثر', 'گلدیرا': '#گلدیرا', 'گوهران': '#گوهران', 'لطیف': '#لطیف', 'مادیرا': '#مادیرا',
                 'مارون': '#مارون', 'مدیریت': '#مدیریت', 'معین': '#معین', 'مفاخر': '#مفاخر', 'میهن': '#میهن',
                 'ناما': '#ناما', 'نخریس': '#نخریس', 'نطرین': '#نطرین', 'نوین': '#نوین', 'نیان': '#نیان',
                 'هجرت': '#هجرت', 'هرمز': '#هرمز', 'وآوا': '#وآوا', 'والماس': '#والماس', 'وامین': '#وامین',
                 'وپویا': '#وپویا', 'وتعاون': '#وتعاون', 'ودی': '#ودی', 'وسبحان': '#وسبحان', 'وسپهر': '#وسپهر',
                 'وطوبی': '#وطوبی', 'وکبهمن': '#وکبهمن', 'وگردش': '#وگردش', 'وگستر': '#وگستر', 'ولبهمن': '#ولبهمن',
                 'ولتجار': '#ولتجار', 'ولشرق': '#ولشرق', 'ومعلم': '#ومعلم', 'وملل': '#وملل', 'وهامون': '#وهامون',
                 'وهور': '#وهور', 'شتهران': '#شتهران', 'کارام': '#کارام', 'کازرو': '#کازرو', 'ممسنی': '#ممسنی',
                 'شلرد': '#شلرد', 'وشمال': '#وشمال', 'زنجان': '#زنجان', 'غمارگ': '#غمارگ', 'تکیمیا': '#تکیمیا',
                 'وبرق': '#وبرق', 'استقلال': '#استقلال', 'پرسپولیس': '#پرسپولیس', 'نیرو': '#نیرو', 'سنوین': '#سنوین',
                 'آینده': '#آینده', 'تفارس': '#تفارس', 'ودانا': '#ودانا', 'بمیلا': '#بمیلا', 'تکنار': '#تکنار',
                 'داراب': '#داراب', 'فسا': '#فسا', 'جهرم': '#جهرم', 'حرهشا': '#حرهشا', 'بپردیس': '#بپردیس',
                 'سخواف': '#سخواف', 'آرمان': '#آرمان', 'حاریا': '#حاریا', 'فلات': '#فلات', 'وکادو': '#وکادو',
                 'غشوکو': '#غشوکو', 'سکارون': '#سکارون', 'شمواد': '#شمواد', 'حبندر': '#حبندر', 'شپلی': '#شپلی',
                 'ولراز': '#ولراز', 'ورازی': '#ورازی', 'ثعتما': '#ثعتما', 'ویسا': '#ویسا', 'ثنظام': '#ثنظام',
                 'وزمین': '#وزمین', 'دی': '#دی', 'دحاوی': '#دحاوی', 'ثجوان': '#ثجوان', 'کمینا': '#کمینا',
                 'کباده': '#کباده', 'وآفر': '#وآفر', 'واحصا': '#واحصا', 'واحیا': '#واحیا', 'سفاسی': '#سفاسی',
                 'وملت': '#وملت', 'خکاوه': '#خکاوه', 'تشتاد': '#تشتاد', 'وفتخار': '#وفتخار', 'گکیش': '#گکیش',
                 'جوین': '#جوین', 'فبیرا': '#فبیرا', 'لکما': '#لکما', 'وثوق': '#وثوق', 'کابگن': '#کابگن',
                 'لازما': '#لازما', 'پلاست': '#پلاست', 'قجام': '#قجام', 'بایکا': '#بایکا', 'غیوان': '#غیوان',
                 'لپیام': '#لپیام', 'غناب': '#غناب', 'وامیر': '#وامیر', 'قنقش': '#قنقش', 'سمایه': '#سمایه',
                 'خصدرا': '#خصدرا', 'شفارا': '#شفارا', 'وثنو': '#وثنو', 'کهرام': '#کهرام', 'وسالت': '#وسالت',
                 'گنگین': '#گنگین', 'فنفت': '#فنفت', 'قیستو': '#قیستو', 'شلیا': '#شلیا', 'قشرین': '#قشرین',
                 'وهنر': '#وهنر', 'شزنگ': '#شزنگ', 'کایتا': '#کایتا', 'لخانه': '#لخانه', 'ثاژن': '#ثاژن',
                 'وشهر': '#وشهر', 'خبازرس': '#خبازرس', 'ومشان': '#ومشان', 'ثنور': '#ثنور', 'ثقزوی': '#ثقزوی',
                 'سپرمی': '#سپرمی', 'ساذری': '#ساذری', 'سایرا': '#سایرا', 'چنوپا': '#چنوپا', 'ولانا': '#ولانا',
                 'سباقر': '#سباقر', 'سمتاز': '#سمتاز', 'تپکو': '#تپکو', 'فجوش': '#فجوش', 'دتهران': '#دتهران',
                 'وآیند': '#وآیند', 'وسرمد': '#وسرمد', 'وسنا': '#وسنا', 'باران': '#باران', 'وارس': '#وارس',
                 'رتکو': '#رتکو', 'وآتوس': '#وآتوس', 'نبروج': '#نبروج', 'ولیز': '#ولیز', 'تمحرکه': '#تمحرکه',
                 'فبستم': '#فبستم', 'وحافظ': '#وحافظ', 'وثخوز': '#وثخوز', 'ولقمان': '#ولقمان', 'قتربت': '#قتربت',
                 'تاتمس': '#تاتمس', 'خبنیان': '#خبنیان', 'بازرگام': '#بازرگام', 'سفارود': '#سفارود', 'فکمند': '#فکمند',
                 'نتوس': '#نتوس', 'وسدید': '#وسدید', 'شتولی': '#شتولی', 'ثزاگرس': '#ثزاگرس', 'خلیبل': '#خلیبل',
                 'وسین': '#وسین', 'وتوسکا': '#وتوسکا', 'فافزا': '#فافزا', 'خودکفا': '#خودکفا', 'شکف': '#شکف',
                 'کفرآور': '#کفرآور', 'فافق': '#فافق', 'حشکوه': '#حشکوه', 'بهیر': '#بهیر', 'خفولا': '#خفولا',
                 'حگردش': '#حگردش', 'تپولا': '#تپولا', 'قاروم': '#قاروم', 'گپارس': '#گپارس', 'وایرا': '#وایرا',
                 'کاریز': '#کاریز', 'ثتوسا': '#ثتوسا', 'فاهواز': '#فاهواز', 'وجامی': '#وجامی', 'آبین': '#آبین',
                 'شکبیر': '#شکبیر', 'دهدشت': '#دهدشت', 'معیار': '#معیار', 'وحکمت': '#وحکمت', 'خعمرا': '#خعمرا',
                 'دشیری': '#دشیری', 'کیسون': '#کیسون', 'وپسا': '#وپسا', 'بتک': '#بتک', 'شستان': '#شستان',
                 'شساخت': '#شساخت', 'خفناور': '#خفناور', 'سلار': '#سلار', 'فسدید': '#فسدید', 'پشاهن': '#پشاهن',
                 'کقزوی': '#کقزوی', 'اتکاسا': '#اتکاسا', 'غبهار': '#غبهار', 'وآرین': '#وآرین', 'ثنام': '#ثنام',
                 'شپترو': '#شپترو', 'ثاصفا': '#ثاصفا', 'شسم': '#شسم', 'پلوله': '#پلوله', 'کورز': '#کورز',
                 'گشان': '#گشان', 'نشار': '#نشار', 'تفیرو': '#تفیرو', 'رفاه': '#رفاه', 'تابا': '#تابا', 'فوکا': '#فوکا',
                 'خپارس': '#خپارس', 'بتهران': '#بتهران', 'فنرژی': '#فنرژی', 'وفردا': '#وفردا', 'پرداخت': '#پرداخت',
                 'تاصیکو': '#تاصیکو', 'خموتور': '#خموتور', 'تکشا': '#تکشا'

                 }


def fetch_all_data():
    url = "https://bvapi.emofid.com/mobile/telegramMessages?channelId=0"

    def get(message_id=None):
        params = dict(count=1000)
        if message_id is not None:
            params["messageId"] = message_id
        headers = {"session-code": "6d7d1361-6665-440a-a7f0-29271c4a2e01"}
        res = requests.get(url, params=params, headers=headers)
        res = res.json()

        with open('bv_news_crawl.jsonl', 'a+', encoding='utf8') as f:
            for i in res:
                f.write(json.dumps(i, ensure_ascii=False) + "\n")
        return res or []

    total = 0
    rows = get()
    total += len(rows)
    print("count ", total)
    last = rows[-1]
    while last:
        rows = get(last["id"])
        count = len(rows)
        print("count ", count)
        total += count
        if count > 0:
            last = rows[-1]
        else:
            break

    print("end ... total", total)


emoji_pattern = re.compile("["
                           u"\U0001F600-\U0001F64F"  # emoticons
                           u"\U0001F300-\U0001F5FF"  # symbols & pictographs
                           u"\U0001F680-\U0001F6FF"  # transport & map symbols
                           u"\U0001F1E0-\U0001F1FF"  # flags (iOS)
                           u"\U00002500-\U00002BEF"  # chinese char
                           u"\U00002702-\U000027B0"
                           u"\U000024C2-\U0001F251"
                           u"\U0001f926-\U0001f937"
                           u"\U00010000-\U0010ffff"
                           u"\u2640-\u2642"
                           u"\u2600-\u2B55"
                           u"\u200d"
                           u"\u23cf"
                           u"\u23e9"
                           u"\u231a"
                           u"\ufe0f"  # dingbats
                           u"\u3030"
                           "]+", flags=re.UNICODE)

# dont add ? to this remove_items list
remove_items = [
    "@",
    "twitter_bourse",
    "telegram",
    "iroilmarket",
    "twitter",
    "instagram",
    "::",
    "«",
    "»",
    "pdf",
    "marketsummary",
    "solutien fardaname",
    "fardaname",
    "ibena_news",
    "website",
    "iroilmarket",
    "ava.agah.co",
    "agahmoshaver",
    "iroilmarket",
    "office607",
    "ibena",
    "www.",
    ".ir",
    ".com",
    "oilmarket",
    "afzayeshs",
    "‏",
    "news",
    "gandomfinance",
    "commolady",
    "!",
    "دانلود",
    "لینک",
    "فیلم",
    "ویدیو",
    "عکس",
    "تصویر",
    "در ساعت",
    "امروز",
    "روزانه",
    "مورخه",
    "مورخ",
    "بلومبرگ فارسی",
    "کانال تحلیلی پارسیس",
    "اختصاصی بازار نفت گاز پتروشیمی",
    "ادامه مطلب",
    "کلیک نمایید",
    "اکوایران",
    "تسنیم",
    "در پست بعدی",
    "در مطلب بعدی",
    "پست بعدی",
    "مطلب بعدی",
    "base_oil",
    "…",
    "sulfur",
    "shahrebours",
    "karoacademy",
    "تجارت‌نیوز",
    "تجارت ‌نیوز",
    "000 gqu",
    "gqu 000",
    "padash",
    "tazehayeeghtesad",
    "farabourse",
    "media",
    "--",
    ":",
    ";",
    "::",
    "#اختصاصی",
    " ",
    "000gss",
    "‌",
    "solutien",
    "⃣",
    "   ",
    "​",
    "000grs"
]

remove_pattern = "|".join(remove_items)
remove_pattern = f"{remove_pattern}"
print(remove_pattern)

skip_these_channels = ["planner",
                       "آموزش مفید",
                       "تحلیل هفتگی بازار سرمایه",
                       "خلاصه بازار",
                       "شرکت کارگزاری مفید"
                       ]

skip_these_topics = ["کارگاه آموزشی",
                     "تپ سواپ",
                     "شمارش آرا",
                     "انتخابات",
                     "بازی جدید تلگرامی",
                     "بازی جدید تلگرام",
                     "بازی تلگرامی",
                     "بازی تلگرام",
                     "صندوق‌های رای",
                     "صندوق‌ رای",
                     "رای گیری",
                     "برگزار می‌گردد"
                     ]

replace_items = {
    "  ": " ",
    "...": " ",
    "..": " ",
    "ریالی": " ریال",
    "میلیاردریال": " میلیارد ریال",
    "میلیارد": " میلیارد",
    "میلیونریال": " میلیون ریال",
    "میلیون": " میلیون",
    "هزارریال": " هزار ریال",
    "هزار": " هزار",
    "ماهه": " ماهه",
    "ماه": " ماه",
    'بتا سهم': '',
    'بازار نفت گاز پتروشیمی': '',
    'پارسیس': '',
    'خلاصه بازار': '',
    'ایبِنا': '',
    'کامولیدی': '',
    'planner': '',
    'آموزش مفید': '',
    'تحلیل هفتگی بازار سرمایه': '',
    'شرکت کارگزاری مفید': '',
    'ژئوپلیتیک': '',
    'بورس ویو': '',
    'کامودیتی': '',
    'methanol': 'متانول',
    'الفینی': 'الفین',
    'معاملات‌های': 'معاملات‌',
    "_": " ",
    "(": " ",
    ")": " ",
    "oilmarket": "",
    " , ": ",",
    "درصدی": " درصدی ",
    "درصد": " درصد ",

}

replace_months = {
    "ژانویه": "january",
    "فوریه": "february",
    "مارس": "march",
    "آوریل": "april",
    "می": "may",
    "ژوئن": "juan",
    "جولای": "july",
    "ژوئیه": "july",
    "آگوست": "august",
    "سپتامبر": "september",
    "اکتبر": "october",
    "نوامبر": "november",
    "دسامبر": "december",
}

map_to_standard_char = {'ك': 'ک',
                        'دِ': 'د',
                        'بِ': 'ب',
                        'زِ': 'ز',
                        'ذِ': 'ذ',
                        'شِ': 'ش',
                        'سِ': 'س',
                        'ى': 'ی',
                        'ي': 'ی',
                        '۰': '0',
                        '۱': '1',
                        '۲': '2',
                        '۳': '3',
                        '۴': '4',
                        '۵': '5',
                        '۶': '6',
                        '۷': '7',
                        '۸': '8',
                        '۹': '9',
                        '.': '.',
                        '١': '1',
                        '٢': '2',
                        '٣': '3',
                        '٤': '4',
                        '٥': '5',
                        '٦': '6',
                        '٧': '7',
                        '٨': '8',
                        '٩': '9',
                        "،": ","
                        }

text_normalizer = hazm.Normalizer(persian_numbers=False, )


def clean_text2(_text):
    text = _text
    for k, v in map_to_standard_char.items():
        text = text.replace(k, v)

    # for k, v in str_to_symbol.items():
    #     __text = text.replace(k, v)
    #     if "##" in __text:
    #         continue
    #     else:
    #         text = __text
    if len(text) < 2:
        return text
    # 12ماهه  -> 12 ماهه
    # text = re.sub('(\d+(\.\d+)?)', r' \1 ', text)
    # text = re.sub(r'(\d[\.\d]*)', r' \1 ', text)
    return text


def clean_text1(_text, retry=0):
    text = _text
    # link
    text = re.sub(r'^https?:\/\/.*[\r\n]*', '', text, flags=re.MULTILINE)
    # date
    text = re.sub(r'\d{4}/\d{1,2}/\d{1,2}', '', text)
    text = re.sub(r'\d{4}.\d{1,2}.\d{1,2}', '', text)
    text = re.sub(r'\d{4}-\d{1,2}-\d{1,2}', '', text)
    # time
    text = re.sub(r'\d{1,2}:\d{2}', '', text)
    # emoji
    text = emoji_pattern.sub(r' ', text)
    text = clean_text2(text)
    # print(text)
    text = re.sub(remove_pattern, r' ', text)
    for k, v in replace_items.items():
        text = text.replace(k, v)
    # text = text_normalizer.normalize(text)
    text = re.sub(remove_pattern, r' ', text)
    for k, v in replace_items.items():
        text = text.replace(k, v)
    text = text.strip()
    for topic in skip_these_topics:
        if topic in _text:
            return None

    for k, v in replace_months.items():
        text = text.replace(f" {k} ", f" {v} ")
    return text


def clean_text0(_text):
    text = _text.replace('|', "\n ")
    text = text.lower()
    arr = text.split('\n')
    arr = map(clean_text1, arr)
    arr = list(filter(lambda x: x is not None, arr))
    if len(arr) == 0:
        return None
    text = " ".join(arr)
    text = clean_text1(text)
    if text == "" or text is None:
        return None
    # text = text_normalizer.normalize(text)
    text = text.replace("  ", " ")
    return text


def bv_news_cleaner_fn(obj):
    channel = (obj['channelName'] or "").lower()
    if channel in skip_these_channels:
        return None
    _date = jdatetime.datetime.strptime(obj["date"], "%Y/%m/%d-%H:%M:%S") if obj["date"] else None
    _date = _date.togregorian().strftime("%Y-%m-%dT%H:%M:%S") if _date else None
    _text = obj["text"]
    _text = clean_text0(_text)
    if _text == "" or _text is None:
        return None
    result = dict()
    result["id"] = obj['id']
    result["date"] = _date
    result["text"] = _text
    result["org_text"] = obj["text"]
    result["channel"] = channel
    r = random.random()
    sentiment = "positive" if r > 0.66 else "negative" if r < 0.33 else "neutral"
    result["sentiment"] = sentiment
    return result


def process_news():
    """"
    {"id": 406956,
    "date": "1403/04/19-13:55:59",
     "text": "دبیر انجمن خودروسازان:\n▪️شرکت‌های ایران خودرو و سایپا در انتظار ابلاغ قیمت‌های جدید از سوی وزارت صمت هستند.",
      "hyperText": null,
       "mediaPath": null,
       "IsDeleted": false,
        "channelName": "بتا سهم"}
    """

    with jsonlines.open('./bv_news_crawl.jsonl') as reader:
        rows = [dict(obj) for obj in reader]
        import multiprocessing as mp
        with mp.Pool(8) as pool:
            results = pool.map(bv_news_cleaner_fn, rows)
            results = list(filter(lambda x: x is not None, results))
            print("results", len(results))
            df = pl.from_records(results)
            df.write_csv('./bv_news.csv')


def process_news2():
    with jsonlines.open('./bv_news_crawl.jsonl') as reader:
        rows = []
        for obj in reader:
            rows.append(bv_news_cleaner_fn(obj))
            if len(rows) > 2000:
                break

        rows = list(filter(lambda x: x is not None, rows))
        df = pl.from_records(rows)
        df.write_csv('./bv_news2.csv')


def extract_vocab():
    import hazm
    df = pl.read_csv('./bv_news.csv')
    vocab = dict()
    for row in df.rows(named=True):
        _text = row["text"]
        _text = _text.replace("\u200c", " ")
        _text = re.sub(r"_|-", " ", _text)
        # print(row["text"])
        # print(_text)
        for t in hazm.word_tokenize(_text):
            t2 = re.sub(r'،|;|:', "", t).replace(".", "")
            t2 = ''.join([i for i in t2 if not i.isdigit()])
            # t3 = t2.split("\u200c")
            # for i in t3:
            #     if len(i) > 0:
            #         vocab[i] = None

            vocab[t2] = None

    d = list(vocab.keys())
    print(len(d))
    print(d)
    with open('./d.txt', 'w+', encoding='utf8') as f:
        d2 = "\n".join(d)
        f.write(d2)


if __name__ == '__main__':
    # fetch_all_data()

    # process_news()
    process_news2()
    # s = "شرکت تام ایران خودرو سهامی عام در گزارش 12ماهه به سود 1314 میلیارد ریال رسیده است"
    # print(s)
    # print(clean_text2(s))
    # extract_vocab()
