from bv_news_crawler import clean_text0

ENDOFTEXT = "<|endoftext|>"
VOCAB_SIZE = 3500
ENDOFTEXT_TOKEN = VOCAB_SIZE

def fn():
    import polars as pl
    df = pl.read_csv('./stocks.csv')

    stocks = dict()
    for r in df.rows(named=True):
        stocks[r["Ticker"]] = None

    # print(list(stocks.keys()))

    def x2(x):
        return f"{clean_text0(x[0])}"

    # print(1)
    new_col = df.select(pl.col('Ticker').alias("Name2")).apply(x2)
    df = df.with_columns(new_col)

    df.write_csv('./stocks2.csv')


def fn2():
    new_items = [
        'آباد', 'آبادا', 'آپ', 'آسیا', 'اپال', 'اتکام', 'اخابر', 'اردستان', 'اسیاتک', 'افق', 'البرز',
        'امید', 'امین', 'انرژی', 'بالبر', 'بترانس', 'برکت', 'بسویچ', 'بشهاب', 'بفجر', 'بکاب', 'بکام',
        'بموتو',
        'بنیرو', 'بورس', 'بوعلی', 'پارس', 'پارسان', 'پارسیان', 'پاسا', 'پاکشو', 'پتایر', 'پترول', 'پدرخش',
        'پردیس',
        'پسهند', 'پکرمان', 'پکویر', 'پلاسک', 'پی پاد', 'تاپیکو', 'تایرا', 'تپمپی', 'تکاردان', 'تکمبا',
        'تکنو', 'تملت', 'تنوین', 'تیپیکو', 'ثاخت', 'ثامان', 'ثامید', 'ثبهساز', 'ثشاهد', 'ثشرق', 'ثفارس',
        'ثمسکن',
        'ثنوسا', 'جم', 'جم پیلن', 'چافست', 'چدن', 'چفیبر', 'چکاپا', 'چکارن', 'چکاوه', 'حپترو', 'حتاید',
        'حتوکا', 'حفارس', 'حفاری', 'حکشتی', 'خاذین', 'خاهن', 'خبهمن', 'خپویش', 'ختراک', 'ختور', 'ختوقا',
        'خچرخش',
        'خراسان', 'خریخت', 'خرینگ', 'خزامیا', 'خزر', 'خساپا', 'خشرق', 'خفنر', 'خکار', 'خکمک', 'خگستر',
        'خلنت', 'خمحرکه', 'خمحور', 'خمهر', 'خنصیر', 'خودرو', 'خوساز', 'دابور', 'داتام', 'دارو', 'داسوه',
        'دالبر',
        'دامین', 'دانا', 'دپارس', 'دتماد', 'دجابر', 'ددام', 'درازک', 'دروز', 'دزهراوی', 'دسبحا', 'دسبحان',
        'دسینا', 'دشیمی', 'دعبید', 'دفارا', 'دفرا', 'دکوثر', 'دکیمی', 'دلر', 'دلقما', 'دیران', 'ذوب',
        'رانفور', 'رتاپ', 'رکیش', 'رمپنا', 'زپارس', 'زکوثر', 'زمگسا', 'سآبیک', 'ساراب', 'ساربیل', 'ساروم',
        'سبجنو',
        'سبهان', 'سپ', 'سپاها', 'سپید', 'ستران', 'سخاش', 'سخزر', 'سخوز', 'سدشت', 'سدور', 'سرود', 'سشرق',
        'سشمال', 'سصفها', 'سصوفی', 'سغرب', 'سفار', 'سفارس', 'سفانو', 'سقاین', 'سکرد', 'سکرما', 'سمازن',
        'سنیر', 'سهرمز', 'سهگمت', 'سیتا', 'سیدکو', 'سیستم', 'سیلام', 'سیمرغ', 'شاراک', 'شاملا', 'شبریز',
        'شبندر',
        'شبهرن', 'شپارس', 'شپاکسا', 'شپدیس', 'شپنا', 'شتران', 'شخارک', 'شدوص', 'شراز', 'شسپا', 'شستا',
        'شسینا', 'شغدیر', 'شفا', 'شفارس', 'شفن', 'شکربن', 'شکلر', 'شگل', 'شلعاب', 'شنفت', 'شهر', 'شوینده',
        'شیراز',
        'شیران', 'صبا', 'غاذر', 'غالبر', 'غبشهر', 'غبهنوش', 'غپاک', 'غپینو', 'غچین', 'غدام', 'غدشت', 'غزر',
        'غسالم', 'غشاذر', 'غشان', 'غشصفا', 'غشهد', 'غکورش', 'غگرجی', 'غگل', 'غمهرا', 'غنوش', 'فاذر',
        'فاراک', 'فارس', 'فاسمین', 'فاما', 'فایرا', 'فباهنر', 'فپنتا', 'فجام', 'فجر', 'فخاس', 'فخوز',
        'فرآور',
        'فروس', 'فسازان', 'فسبزوار', 'فسپا', 'فسرب', 'فلامی', 'فلوله', 'فمراد', 'فملی', 'فنوال', 'فنورد',
        'فولاد',
        'فولاژ', 'قپیرا', 'قثابت', 'قرن', 'قزوین', 'قشکر', 'قشهد', 'قصفها', 'قلرست', 'قمرو', 'قنیشا',
        'قهکمت', 'کاذر', 'کالا', 'کاما', 'کاوه', 'کبافق', 'کپارس', 'کپشیر', 'کترام', 'کچاد', 'کحافظ',
        'کخاک', 'کدما',
        'کرازی', 'کرماشا', 'کروی', 'کساپا', 'کساوه', 'کسرا', 'کسرام', 'کسعدی', 'کطبس', 'کفپارس', 'کفرا',
        'کگاز', 'کگل', 'کلوند', 'کماسه', 'کمنگنز', 'کنور', 'کهمدا', 'کویر', 'کیمیا', 'کیمیاتک', 'لابسا',
        'لبوتان',
        'لپارس', 'لخزر', 'لسرما', 'لوتوس', 'ما', 'مبین', 'مداران', 'ملت', 'میدکو', 'نمرینو', 'نوری',
        'های وب', 'همراه', 'وآذر', 'وآفری', 'واتی', 'واعتبار', 'والبر', 'وامید', 'وایران', 'وبانک', 'وبشهر',
        'وبصادر',
        'وبملت', 'وبهمن', 'وبوعلی', 'وبیمه', 'وپارس', 'وپاسار', 'وپترو', 'وپخش', 'وپست', 'وتجارت', 'وتوس',
        'وتوسم', 'وتوشه', 'وتوصا', 'وتوکا', 'وخارزم', 'وخاور', 'ورنا', 'وساپا', 'وساخت', 'وساربیل',
        'وساشرقی', 'وساغربی', 'وسبوشهر', 'وسپه', 'وسخراج', 'وسخراش', 'وسخوز', 'وسرضوی', 'وسزنجان', 'وسصفا',
        'وسفارس',
        'وسقم', 'وسکاب', 'وسکرد', 'وسکرشا', 'وسکرمان', 'وسکهبو', 'وسگلستا', 'وسگیلا', 'وسلرستا', 'وسمازن',
        'وسمرکز', 'وسهرمز', 'وسهمدا', 'وسیزد', 'وسیستا', 'وسیلام', 'وسینا', 'وصنا', 'وصندوق', 'وصنعت',
        'وغدیر', 'وکار', 'وکغدیر', 'ولپارس', 'ولساپا', 'ولصنم', 'ولغدر', 'ولکار', 'ولملت', 'ومدیر', 'ومعادن',
        'وملی',
        'ومهان', 'ونفت', 'ونوین', 'ونیرو', 'ونیکی', 'آ س پ', 'آردینه', 'آریا', 'آریان', 'اپرداز', 'اتکای',
        'ارفع', 'اعتلا', 'افرا', 'انتخاب', 'اوان', 'بالاس', 'بپاس', 'بپیوند', 'بجهرم', 'بخاور', 'بزاگرس',
        'بساما', 'بکابل', 'بکهنوج', 'بگیلان', 'بمپنا', 'بمولد', 'بنو', 'بهپاک', 'بیوتیک', 'پارتا', 'پخش',
        'پیزد', 'تاپکیش', 'تبرک', 'تپسی', 'تجلی', 'تلیسه', 'تماوند', 'توریل', 'توسن', 'ثالوند', 'ثباغ',
        'ثپردیس', 'ثتران', 'ثجنوب', 'ثرود', 'ثعمرا', 'ثغرب', 'چخزر', 'حآسا', 'حآفرین', 'حپارسا', 'حپرتو',
        'حخزر', 'حریل', 'حسیر', 'حسینا', 'حگهر', 'خاور', 'خدیزل', 'خکرمان', 'خنور', 'داوه', 'دبالک',
        'دتوزیع', 'دتولید', 'ددانا', 'درازی', 'درهآور', 'دسانکو', 'دقاضی', 'دکپسول', 'دماوند', 'رافزا',
        'رنیک',
        'ریشمک', 'زاگرس', 'زبینا', 'زدشت', 'زشریف', 'زشگزا', 'زفجر', 'زفکا', 'زقیام', 'زکشت', 'زگلدشت',
        'زماهان',
        'زملارد', 'زنگان', 'ساروج', 'سامان', 'ساوه', 'ساینا', 'سبزوا', 'سپیدار', 'سجام', 'سدبیر', 'سرچشمه',
        'سغدیر', 'سمگا', 'شاروم', 'شاوان', 'شبصیر', 'شپاس', 'شتوکا', 'شجم', 'شرانل', 'شصدف', 'شفام', 'شکام',
        'شگویا', 'شملی', 'عالیس', 'غپآذر', 'غپونه', 'غدانه', 'غدیس', 'غشهداب', 'غصینو', 'غفارس', 'غگلپا',
        'غگلستا', 'غگیلا', 'غمایه', 'غمینو', 'غویتا', 'فالوم', 'فتوسا', 'فجهان', 'فرابورس', 'فرود', 'فروژ',
        'فروسیل', 'فروی', 'فزر', 'فزرین', 'فسوژ', 'فصبا', 'فغدیر', 'فگستر', 'فن افزار', 'فنر', 'فولای',
        'قاسم', 'قچار', 'قشیر', 'کاسپین', 'کایزد', 'کپرور', 'کتوسعه', 'کتوکا', 'کرمان', 'کرومیت', 'کزغال',
        'کشرق',
        'کگهر', 'کلر', 'کمرجان', 'کوثر', 'کی بی سی', 'گدنا', 'گکوثر', 'گلدیرا', 'گوهران', 'لطیف', 'مادیرا',
        'مارون', 'مدیریت', 'معین', 'مفاخر', 'میهن', 'ناما', 'نخریس', 'نطرین', 'نوین', 'نیان', 'هجرت',
        'هرمز', 'وآوا', 'والماس', 'وامین', 'وپویا', 'وتعاون', 'ودی', 'وسبحان', 'وسپهر', 'وطوبی', 'وکبهمن',
        'وگردش',
        'وگستر', 'ولبهمن', 'ولتجار', 'ولشرق', 'ومعلم', 'وملل', 'وهامون', 'وهور', 'شتهران', 'کارام', 'کازرو',
        'ممسنی', 'شلرد', 'وشمال', 'زنجان', 'غمارگ', 'تکیمیا', 'وبرق', 'استقلال', 'پرسپولیس', 'نیرو', 'سنوین',
        'آینده', 'تفارس', 'ودانا', 'بمیلا', 'تکنار', 'داراب', 'فسا', 'جهرم', 'حرهشا', 'بپردیس', 'سخواف',
        'آرمان', 'حاریا', 'فلات', 'وکادو', 'غشوکو', 'سکارون', 'شمواد', 'حبندر', 'شپلی', 'ولراز', 'ورازی',
        'ثعتما', 'ویسا', 'ثنظام', 'وزمین', 'دی', 'دحاوی', 'ثجوان', 'کمینا', 'کباده', 'وآفر', 'واحصا',
        'واحیا', 'سفاسی', 'وملت', 'خکاوه', 'تشتاد', 'وفتخار', 'گکیش', 'جوین', 'فبیرا', 'لکما', 'وثوق',
        'کابگن',
        'لازما', 'پلاست', 'قجام', 'بایکا', 'غیوان', 'لپیام', 'غناب', 'وامیر', 'قنقش', 'سمایه', 'خصدرا',
        'شفارا',
        'وثنو', 'کهرام', 'وسالت', 'گنگین', 'فنفت', 'قیستو', 'شلیا', 'قشرین', 'وهنر', 'شزنگ', 'کایتا',
        'لخانه',
        'ثاژن', 'وشهر', 'خبازرس', 'ومشان', 'ثنور', 'ثقزوی', 'سپرمی', 'ساذری', 'سایرا', 'چنوپا', 'ولانا',
        'سباقر',
        'سمتاز', 'تپکو', 'فجوش', 'دتهران', 'وآیند', 'وسرمد', 'وسنا', 'باران', 'وارس', 'رتکو', 'وآتوس',
        'نبروج', 'ولیز', 'تمحرکه', 'فبستم', 'وحافظ', 'وثخوز', 'ولقمان', 'قتربت', 'تاتمس', 'خبنیان',
        'بازرگام',
        'سفارود', 'فکمند', 'نتوس', 'وسدید', 'شتولی', 'ثزاگرس', 'خلیبل', 'وسین', 'وتوسکا', 'فافزا', 'خودکفا',
        'شکف',
        'کفرآور', 'فافق', 'حشکوه', 'بهیر', 'خفولا', 'حگردش', 'تپولا', 'قاروم', 'گپارس', 'وایرا', 'کاریز',
        'ثتوسا', 'فاهواز', 'وجامی', 'آبین', 'شکبیر', 'دهدشت', 'معیار', 'وحکمت', 'خعمرا', 'دشیری', 'کیسون',
        'وپسا', 'بتک', 'شستان', 'شساخت', 'خفناور', 'سلار', 'فسدید', 'پشاهن', 'کقزوی', 'اتکاسا', 'غبهار',
        'وآرین', 'ثنام', 'شپترو', 'ثاصفا', 'شسم', 'پلوله', 'کورز', 'گشان', 'نشار', 'تفیرو', 'رفاه', 'تابا',
        'فوکا', 'خپارس', 'بتهران', 'فنرژی', 'وفردا', 'پرداخت', 'تاصیکو', 'خموتور', 'تکشا',

        'ا', 'ب', 'ت', 'ث', 'ج', 'ح', 'خ', 'د', 'ذ', 'ر', 'ز', 'س', 'ش', 'ص', 'ض',
        'ط', 'ظ', 'ع', 'غ', 'ف', 'ق', 'ل', 'م', 'ن', 'ه', 'و', 'پ', 'چ', 'ک', 'گ', 'ی',

        'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p',
        'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',

        '0', '1', '2', '3', '4', '5', '6', '7', '8', '9',

        "january", "february", "march", "april", "may", "juan", "july",
        "july", "august", "september", "october", "november", "december",

        "فروردین", "اردیبهشت", "خرداد", "تیر", "مرداد", "شهریور",
        "مهر", "آبان", "آذر", "دی", "بهمن", "اسفند"
    ]

    import polars as pl

    df = pl.read_csv('./bv_news2.csv')
    special_tokens = ["positive", "neutral", "negative"]



    text = " ".join(df["text"].to_list())
    text += " " + " ".join(new_items)

    print("new_items  ", len(new_items))

    import tiktoken._educational as ed

    pat_str = "|".join(
        [
            r"""[^\r\n\p{L}\p{N}]?[\p{Lu}\p{Lt}\p{Lm}\p{Lo}\p{M}]*[\p{Ll}\p{Lm}\p{Lo}\p{M}]+(?i:'s|'t|'re|'ve|'m|'ll|'d)?""",
            r"""[^\r\n\p{L}\p{N}]?[\p{Lu}\p{Lt}\p{Lm}\p{Lo}\p{M}]+[\p{Ll}\p{Lm}\p{Lo}\p{M}]*(?i:'s|'t|'re|'ve|'m|'ll|'d)?""",
            r"""\p{N}{1,3}""",
            r""" ?[^\s\p{L}\p{N}]+[\r\n/]*""",
            r"""\s*[\r\n]+""",
            r"""\s+(?!\S)""",
            r"""\s+""",
        ]
    )

    enc = ed.SimpleBytePairEncoding(pat_str=pat_str, mergeable_ranks=dict())

    trained_vocab_size = VOCAB_SIZE - len(special_tokens) - 1

    enc = enc.train(training_data=text, vocab_size=trained_vocab_size, pat_str=pat_str)

    for item in special_tokens:
        trained_vocab_size += 1
        enc.mergeable_ranks[bytes(item, 'utf-8')] = trained_vocab_size

    enc.mergeable_ranks[bytes(ENDOFTEXT, 'utf-8')] = VOCAB_SIZE

    print(len(enc.mergeable_ranks.keys()))
    print(enc.mergeable_ranks)
    import pickle
    print("saving to tiktoken_trained.iso")
    file = open('./tiktoken_trained.iso', 'wb')
    pickle.dump(enc.mergeable_ranks, file)
    file.close()


def fn3():
    print("... loading from tiktoken_trained.iso")
    import pickle
    f = open('./tiktoken_trained.iso', 'rb')
    data = pickle.load(f)
    # print(data)
    f.close()

    import tiktoken._educational as ed

    pat_str = "|".join(
        [
            r"""[^\r\n\p{L}\p{N}]?[\p{Lu}\p{Lt}\p{Lm}\p{Lo}\p{M}]*[\p{Ll}\p{Lm}\p{Lo}\p{M}]+(?i:'s|'t|'re|'ve|'m|'ll|'d)?""",
            r"""[^\r\n\p{L}\p{N}]?[\p{Lu}\p{Lt}\p{Lm}\p{Lo}\p{M}]+[\p{Ll}\p{Lm}\p{Lo}\p{M}]*(?i:'s|'t|'re|'ve|'m|'ll|'d)?""",
            r"""\p{N}{1,3}""",
            r""" ?[^\s\p{L}\p{N}]+[\r\n/]*""",
            r"""\s*[\r\n]+""",
            r"""\s+(?!\S)""",
            r"""\s+""",
        ]
    )
    enc = ed.SimpleBytePairEncoding(pat_str=pat_str, mergeable_ranks=data)
    return enc


if __name__ == '__main__':
    print('....')
    # fn()
    # fn2()
    # fn3()
