{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|begin_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|end_of_text|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<space>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Strip",
        "strip_left": true,
        "strip_right": true
      },
      {
        "type": "NFD"
      },
      {
        "type": "BertNormalizer",
        "clean_text": true,
        "handle_chinese_chars": true,
        "strip_accents": true,
        "lowercase": true
      },
      {
        "type": "Replace",
        "pattern": {
          "Regex": "\\s{2,}"
        },
        "content": "<space>"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": " "
        },
        "content": "<space>"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Digits",
        "individual_digits": true
      },
      {
        "type": "Split",
        "pattern": {
          "String": "(?i:'s|'t|'re|'ve|'m|'ll|'d)|[^\\r\\n\\p{L}\\p{N}]?\\p{L}+|\\p{N}{1,3}| ?[^\\s\\p{L}\\p{N}]+[\\r\\n]*|\\s*[\\r\\n]+|\\s+(?!\\S)|\\s+"
        },
        "behavior": "MergedWithPrevious",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": {
    "type": "BPEDecoder",
    "suffix": "<space>"
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|begin_of_text|>": 0,
      "<|end_of_text|>": 1,
      "<space>": 2,
      "$": 3,
      "%": 4,
      "&": 5,
      "+": 6,
      "-": 7,
      ".": 8,
      "0": 9,
      "1": 10,
      "2": 11,
      "3": 12,
      "4": 13,
      "5": 14,
      "6": 15,
      "7": 16,
      "8": 17,
      "9": 18,
      "<": 19,
      "=": 20,
      ">": 21,
      "?": 22,
      "[": 23,
      "]": 24,
      "^": 25,
      "a": 26,
      "b": 27,
      "c": 28,
      "d": 29,
      "e": 30,
      "f": 31,
      "g": 32,
      "h": 33,
      "i": 34,
      "j": 35,
      "k": 36,
      "l": 37,
      "m": 38,
      "n": 39,
      "o": 40,
      "p": 41,
      "q": 42,
      "r": 43,
      "s": 44,
      "t": 45,
      "u": 46,
      "v": 47,
      "w": 48,
      "x": 49,
      "y": 50,
      "z": 51,
      "£": 52,
      "ا": 53,
      "ب": 54,
      "ت": 55,
      "ث": 56,
      "ج": 57,
      "ح": 58,
      "خ": 59,
      "د": 60,
      "ذ": 61,
      "ر": 62,
      "ز": 63,
      "س": 64,
      "ش": 65,
      "ص": 66,
      "ض": 67,
      "ط": 68,
      "ظ": 69,
      "ع": 70,
      "غ": 71,
      "ف": 72,
      "ق": 73,
      "ل": 74,
      "م": 75,
      "ن": 76,
      "ه": 77,
      "و": 78,
      "٫": 79,
      "پ": 80,
      "چ": 81,
      "ژ": 82,
      "ک": 83,
      "گ": 84,
      "ی": 85,
      "–": 86,
      "—": 87,
      "‚": 88,
      "€": 89,
      "ce": 90,
      "sp": 91,
      "ace": 92,
      "space": 93,
      "<space": 94,
      "ه<space>": 95,
      "ی<space>": 96,
      "ر<space>": 97,
      "ن<space>": 98,
      "د<space>": 99,
      "ت<space>": 100,
      "ا<space>": 101,
      "ای": 102,
      "ار": 103,
      "در<space>": 104,
      "<space>م": 105,
      "از": 106,
      "ال": 107,
      "و<space>": 108,
      "ان<space>": 109,
      "ان": 110,
      "اس": 111,
      "به<space>": 112,
      "ای<space>": 113,
      "ام": 114,
      "ش<space>": 115,
      "رو": 116,
      ".<space>": 117,
      "ری": 118,
      "ده<space>": 119,
      "لی": 120,
      "از<space>": 121,
      "ار<space>": 122,
      "تو": 123,
      "ل<space>": 124,
      "که<space>": 125,
      "ال<space>": 126,
      "م<space>": 127,
      "بر": 128,
      "اه": 129,
      "های<space>": 130,
      "ات<space>": 131,
      "ود<space>": 132,
      "ین<space>": 133,
      "اف": 134,
      "ور": 135,
      "دا": 136,
      "این<space>": 137,
      "ته<space>": 138,
      "می<space>": 139,
      "است": 140,
      "د.<space>": 141,
      "با<space>": 142,
      "<space>می": 143,
      "را<space>": 144,
      "<space>میلی": 145,
      "یم": 146,
      "ارد<space>": 147,
      "رک": 148,
      "اد": 149,
      "اب": 150,
      "سی": 151,
      "است<space>": 152,
      "ند<space>": 153,
      "ز<space>": 154,
      "دی": 155,
      "کر": 156,
      "<space>%": 157,
      "اه<space>": 158,
      "باز": 159,
      "قیم": 160,
      "نف": 161,
      "س<space>": 162,
      "ک<space>": 163,
      "قیمت<space>": 164,
      "بو": 165,
      "مان<space>": 166,
      "فرو": 167,
      "ق<space>": 168,
      "ام<space>": 169,
      "<space>%<space>": 170,
      "ها<space>": 171,
      "ول": 172,
      "نی": 173,
      "شد<space>": 174,
      "تی<space>": 175,
      "سال<space>": 176,
      "است.<space>": 177,
      "بازار<space>": 178,
      "برای<space>": 179,
      "خو": 180,
      "اخ": 181,
      "بی": 182,
      "ور<space>": 183,
      "می": 184,
      "<space>٫": 185,
      "<space>٫<space>": 186,
      "کن": 187,
      "ون<space>": 188,
      "ست": 189,
      "اد<space>": 190,
      "ع<space>": 191,
      "ران<space>": 192,
      "اق": 193,
      "نفت<space>": 194,
      "زای": 195,
      "هم": 196,
      "فروش<space>": 197,
      "$<space>": 198,
      "اری<space>": 199,
      "شته<space>": 200,
      "شده<space>": 201,
      "تص": 202,
      "مو": 203,
      "لی<space>": 204,
      "شرک": 205,
      "کاه": 206,
      "افزای": 207,
      "تومان<space>": 208,
      "یر<space>": 209,
      "انه<space>": 210,
      "گذ": 211,
      "شرکت<space>": 212,
      "تا<space>": 213,
      "ریال<space>": 214,
      "ند": 215,
      "رف": 216,
      "افزایش<space>": 217,
      "کاهش<space>": 218,
      "ب<space>": 219,
      "تح": 220,
      "او": 221,
      "عام": 222,
      "اع": 223,
      "کش": 224,
      "نگ": 225,
      "ماه<space>": 226,
      "بت<space>": 227,
      "وی": 228,
      "ده": 229,
      "پی": 230,
      "تر": 231,
      "تر<space>": 232,
      "تن<space>": 233,
      "در": 234,
      "ایی<space>": 235,
      "هر<space>": 236,
      "خ<space>": 237,
      "عامل": 238,
      "انی<space>": 239,
      "ایران<space>": 240,
      "بر<space>": 241,
      "زی": 242,
      "مح": 243,
      "دی<space>": 244,
      "نی<space>": 245,
      "تولی": 246,
      "بان": 247,
      "اور": 248,
      "رشد<space>": 249,
      "اص": 250,
      "ط<space>": 251,
      "من": 252,
      "یر": 253,
      "رسی": 254,
      "اش": 255,
      "سر": 256,
      "پای": 257,
      "تق": 258,
      "نر": 259,
      "عر": 260,
      "الی<space>": 261,
      "رین<space>": 262,
      "روز<space>": 263,
      "اح": 264,
      "دار": 265,
      "زی<space>": 266,
      "خود<space>": 267,
      "دو": 268,
      "مای": 269,
      "نو": 270,
      "<space>ه": 271,
      "زار<space>": 272,
      "<space>می<space>": 273,
      "<space>$<space>": 274,
      "است<space>که<space>": 275,
      "رس": 276,
      "هم<space>": 277,
      "جه<space>": 278,
      "خواه": 279,
      "نس": 280,
      "نرخ<space>": 281,
      "زار": 282,
      "تولید<space>": 283,
      "در<space>ح": 284,
      "بوده<space>": 285,
      "فته<space>": 286,
      "ف<space>": 287,
      "<space>ماه": 288,
      "گر": 289,
      "ول<space>": 290,
      "اض": 291,
      "اقتص": 292,
      "و<space>م": 293,
      "به": 294,
      "نسبت<space>": 295,
      "جه": 296,
      "ادی<space>": 297,
      "بود<space>": 298,
      "داد<space>": 299,
      "د.": 300,
      "قر": 301,
      "<space>هزار<space>": 302,
      "فر": 303,
      "نش": 304,
      "یک<space>": 305,
      "گذشته<space>": 306,
      "داشته<space>": 307,
      "سو": 308,
      "ات": 309,
      "ست<space>": 310,
      "سود<space>": 311,
      "شن": 312,
      "شت<space>": 313,
      "یت<space>": 314,
      "بانک": 315,
      "ص<space>": 316,
      "کرد<space>": 317,
      "نده<space>": 318,
      "ارز": 319,
      "اس<space>": 320,
      "خواهد<space>": 321,
      "معامل": 322,
      "تع": 323,
      "هفته<space>": 324,
      "که<space>در<space>": 325,
      "ریک": 326,
      "کشور<space>": 327,
      "اتی<space>": 328,
      "امه<space>": 329,
      "عرض": 330,
      "یا<space>": 331,
      "یاف": 332,
      "مش": 333,
      "بور": 334,
      "عرضه<space>": 335,
      "سه<space>": 336,
      "امریک": 337,
      "صاد": 338,
      "سه": 339,
      "قب": 340,
      "ح<space>": 341,
      "جم": 342,
      "گزار": 343,
      "دن<space>": 344,
      "مر": 345,
      "دول": 346,
      "نظ": 347,
      "تم": 348,
      "شو": 349,
      "ند.<space>": 350,
      "ی<space>از<space>": 351,
      "است.": 352,
      "عم": 353,
      "بال": 354,
      "طل": 355,
      "چین<space>": 356,
      "توس": 357,
      "ساز": 358,
      "بل": 359,
      "چن": 360,
      "کرده<space>": 361,
      "خری": 362,
      "بی<space>": 363,
      "بش": 364,
      "صادر": 365,
      "بورس<space>": 366,
      "اج": 367,
      "ترین<space>": 368,
      "دود<space>": 369,
      "انگ": 370,
      "نه<space>": 371,
      "له<space>": 372,
      "شود<space>": 373,
      "نیز<space>": 374,
      "بن": 375,
      "یم<space>": 376,
      "در<space>م": 377,
      "سیه<space>": 378,
      "مایه<space>": 379,
      "امریکا<space>": 380,
      "تقاض": 381,
      "یه<space>": 382,
      "گاز<space>": 383,
      "سرمایه<space>": 384,
      "نق": 385,
      "کال": 386,
      "همچن": 387,
      "یک": 388,
      "اند<space>": 389,
      "<space>ماهه<space>": 390,
      "دولت<space>": 391,
      "روسیه<space>": 392,
      "دید<space>": 393,
      "بیش": 394,
      "کم": 395,
      "ارز<space>": 396,
      "وار": 397,
      "پر": 398,
      "قاب": 399,
      "در<space>سال<space>": 400,
      "در<space>هر<space>": 401,
      "کار": 402,
      "بانک<space>م": 403,
      "ستان<space>": 404,
      "قبل<space>": 405,
      "رکزی<space>": 406,
      "گر<space>": 407,
      "از<space>م": 408,
      "گاه<space>": 409,
      "تور": 410,
      "صن": 411,
      "غ<space>": 412,
      "ارو": 413,
      "نشان<space>": 414,
      "اک": 415,
      "پیش<space>": 416,
      "ی<space>در<space>": 417,
      "انت": 418,
      "بود": 419,
      "نم": 420,
      "r<space>": 421,
      "داخ": 422,
      "وز": 423,
      "اما<space>": 424,
      "سال": 425,
      "گف": 426,
      "شر": 427,
      "رژ": 428,
      "عه<space>": 429,
      "مع": 430,
      "دت<space>": 431,
      "صادرات<space>": 432,
      "نفت<space>خ": 433,
      "گزارش<space>": 434,
      "پا<space>": 435,
      "اختص": 436,
      "اختصاص": 437,
      "به<space>د": 438,
      "می<space>ده": 439,
      "انرژ": 440,
      "ورد<space>": 441,
      "ج<space>": 442,
      "اقتصادی<space>": 443,
      "شم": 444,
      "بخ": 445,
      "کل<space>": 446,
      "اره<space>": 447,
      "-<space>": 448,
      "بای": 449,
      "گیر": 450,
      "است<space>و<space>": 451,
      "شی": 452,
      "ات<space>م": 453,
      "باش": 454,
      "اده<space>": 455,
      "محص": 456,
      "ل<space>م": 457,
      "تل": 458,
      "فع": 459,
      "ترو": 460,
      "مج": 461,
      "ید<space>": 462,
      "ی<space>به<space>": 463,
      "تج": 464,
      "در<space>این<space>": 465,
      "وق<space>": 466,
      "گذاری<space>": 467,
      "بین<space>": 468,
      "افت<space>": 469,
      "ی<space>و<space>": 470,
      "خود<space>را<space>": 471,
      "ته": 472,
      "نامه<space>": 473,
      "انگین<space>": 474,
      "قرار<space>": 475,
      "y<space>": 476,
      "پایان<space>": 477,
      "ریی": 478,
      "ارزش<space>": 479,
      "لیل<space>": 480,
      "ar": 481,
      "گو": 482,
      "دارد<space>": 483,
      "اق<space>": 484,
      "نگ<space>": 485,
      "همچنین<space>": 486,
      "دار<space>": 487,
      "با": 488,
      "شد.<space>": 489,
      "اب<space>": 490,
      "عد": 491,
      "نماد<space>": 492,
      "انرژی<space>": 493,
      "هی": 494,
      "ش<space>م": 495,
      "داده<space>": 496,
      "صور": 497,
      "گان<space>": 498,
      "تی": 499,
      "انج": 500,
      "be": 501,
      "کند<space>": 502,
      "زر": 503,
      "اختصاصی<space>": 504,
      "حدود<space>": 505,
      "رسیده<space>": 506,
      "خرید<space>": 507,
      "اروپا<space>": 508,
      "لام<space>": 509,
      "بانک<space>": 510,
      "خر": 511,
      "گرف": 512,
      "یل": 513,
      "اساس<space>": 514,
      "های<space>م": 515,
      "سته<space>": 516,
      "تغ": 517,
      "<space>تن<space>": 518,
      "<space>مو": 519,
      "ثبت<space>": 520,
      "بلغ<space>": 521,
      "ت.<space>": 522,
      "دات<space>": 523,
      "گفت<space>": 524,
      "پترو": 525,
      "ره<space>": 526,
      "ماه": 527,
      "حم": 528,
      "صورت<space>": 529,
      "نظر<space>": 530,
      "داشت<space>": 531,
      "بود.<space>": 532,
      "<space>و<space>": 533,
      "امین<space>": 534,
      "صنع": 535,
      "ایر<space>": 536,
      "تش": 537,
      "رییس<space>": 538,
      "قی<space>": 539,
      "جود<space>": 540,
      "عی<space>": 541,
      "می<space>دهد<space>": 542,
      "واح": 543,
      "بیشتر<space>": 544,
      "an": 545,
      "شنبه<space>": 546,
      "معاملات<space>": 547,
      "و<space>به<space>": 548,
      "رف<space>": 549,
      "صو": 550,
      "باید<space>": 551,
      "بد": 552,
      "شود.<space>": 553,
      "<space>به<space>": 554,
      "ولات<space>": 555,
      "اعلام<space>": 556,
      "پال": 557,
      "پس<space>": 558,
      "اقتصاد<space>": 559,
      "توسط<space>": 560,
      "کو": 561,
      "جهانی<space>": 562,
      "گرو": 563,
      "کالا<space>": 564,
      "ber<space>": 565,
      "پالای": 566,
      "می<space>تو": 567,
      "بینی<space>": 568,
      "بشکه<space>": 569,
      "دو<space>": 570,
      "هست": 571,
      "روند<space>": 572,
      "برگ": 573,
      "این": 574,
      "قو": 575,
      "تغی": 576,
      "تامین<space>": 577,
      "معامله<space>": 578,
      "امل<space>": 579,
      "دری": 580,
      "توجه<space>": 581,
      "اث": 582,
      "زان<space>": 583,
      "و<space>در<space>": 584,
      "بیش<space>": 585,
      "ابه<space>": 586,
      "مدت<space>": 587,
      "شاه": 588,
      "طر": 589,
      "شیمی<space>": 590,
      "واردات<space>": 591,
      "تب": 592,
      "انتظ": 593,
      "پرو": 594,
      "خار": 595,
      "تورم<space>": 596,
      "اند": 597,
      "یل<space>": 598,
      "امی<space>": 599,
      "ندگان<space>": 600,
      "میانگین<space>": 601,
      "عاملات<space>": 602,
      "در<space>حال<space>": 603,
      "داش": 604,
      "برخ": 605,
      "داری<space>": 606,
      "بزر": 607,
      "در<space>ماه<space>": 608,
      "طی<space>": 609,
      "را<space>به<space>": 610,
      "گروه<space>": 611,
      "کاهش<space>یاف": 612,
      "کار<space>": 613,
      "پتروشیمی<space>": 614,
      "بیش<space>از<space>": 615,
      "مل": 616,
      "ضو": 617,
      "بزرگ": 618,
      "هایی<space>": 619,
      "مق": 620,
      "اغ": 621,
      "دیگر<space>": 622,
      "درام": 623,
      "خت<space>": 624,
      "رسید<space>": 625,
      "راه<space>": 626,
      "ژه<space>": 627,
      "وجود<space>": 628,
      "جدید<space>": 629,
      "مدی": 630,
      "سازمان<space>": 631,
      "سی<space>": 632,
      "می<space>شود<space>": 633,
      "مشابه<space>": 634,
      "الی": 635,
      "کند.<space>": 636,
      "پس<space>از<space>": 637,
      "قه<space>": 638,
      "رسی<space>": 639,
      "ترک": 640,
      "اخرین<space>": 641,
      "وله<space>": 642,
      "افزایش<space>یاف": 643,
      "نز": 644,
      "<space>ریال<space>": 645,
      "زم": 646,
      "انجام<space>": 647,
      "ما<space>": 648,
      "زین<space>": 649,
      "ودی<space>": 650,
      "کننده<space>": 651,
      "قی": 652,
      "ادامه<space>": 653,
      "ضع": 654,
      "اوره<space>": 655,
      "روی<space>": 656,
      "ش<space>ماه": 657,
      "قط": 658,
      "اطل": 659,
      "کرد.<space>": 660,
      "الص<space>": 661,
      "بخش<space>": 662,
      "جل": 663,
      "بع": 664,
      "کشور": 665,
      "ولی<space>": 666,
      "ات<space>متح": 667,
      "پل": 668,
      "تقاضای<space>": 669,
      "سهم<space>": 670,
      "رسید.<space>": 671,
      "شی<space>": 672,
      "فعال": 673,
      "<space>تا<space>": 674,
      "چه<space>": 675,
      "تان": 676,
      "محصول<space>": 677,
      "ث<space>": 678,
      "سهام<space>": 679,
      "نت<space>": 680,
      "ایال": 681,
      "تواف": 682,
      "صند": 683,
      "خودر": 684,
      "مان": 685,
      "سط": 686,
      "کرد": 687,
      "ذخ": 688,
      "اپ": 689,
      "تد": 690,
      "ju": 691,
      "بررسی<space>": 692,
      "را<space>در<space>": 693,
      "شه": 694,
      "کن<space>": 695,
      "اسیا<space>": 696,
      "تقاضا<space>": 697,
      "تحری": 698,
      "نمو": 699,
      "خود": 700,
      "شاخ": 701,
      "اخیر<space>": 702,
      "بودجه<space>": 703,
      "ند<space>که<space>": 704,
      "بسی": 705,
      "mber<space>": 706,
      "ایالات<space>متح": 707,
      "رد": 708,
      "فول": 709,
      "برنامه<space>": 710,
      "اک<space>": 711,
      "وی<space>": 712,
      "فص": 713,
      "جاری<space>": 714,
      "اذ": 715,
      "گی<space>": 716,
      "نفتی<space>": 717,
      "سف": 718,
      "تر<space>از<space>": 719,
      "نج": 720,
      "ارت<space>": 721,
      "ایت<space>": 722,
      "توسعه<space>": 723,
      "اقد": 724,
      "باشد<space>": 725,
      "اینده<space>": 726,
      "صندوق<space>": 727,
      "کنی": 728,
      "ابتد": 729,
      "تن": 730,
      "<space>در<space>": 731,
      "چه": 732,
      "سیاست<space>": 733,
      "رود<space>": 734,
      "طور<space>": 735,
      "اکن": 736,
      "اری": 737,
      "میزان<space>": 738,
      "انتظار<space>": 739,
      "<space>تومان<space>": 740,
      "ز<space>م": 741,
      "پرداخ": 742,
      "لیه<space>": 743,
      "است.<space>م": 744,
      "تغییر<space>": 745,
      "دست": 746,
      "تخ": 747,
      "ازی<space>": 748,
      "وب<space>": 749,
      "<space>مالی<space>": 750,
      "اف<space>": 751,
      "بهره<space>": 752,
      "موضو": 753,
      "واحد<space>": 754,
      "شک": 755,
      "وزیر<space>": 756,
      "ارزی<space>": 757,
      "جنو": 758,
      "گرد": 759,
      "م<space>به<space>": 760,
      "گیری<space>": 761,
      "پار": 762,
      "درامد<space>": 763,
      "اول<space>": 764,
      "خصو": 765,
      "مت<space>": 766,
      "صرف<space>": 767,
      "اجر": 768,
      "داران<space>": 769,
      "قرار": 770,
      "ند<space>و<space>": 771,
      "صنعت<space>": 772,
      "تحریم<space>": 773,
      "اکر": 774,
      "دا<space>": 775,
      "وری<space>": 776,
      "لاز": 777,
      "سوخت<space>": 778,
      "بنزین<space>": 779,
      "طبی": 780,
      "نا": 781,
      "ها<space>در<space>": 782,
      "uar": 783,
      "شرای": 784,
      "داخلی<space>": 785,
      "شگاه<space>": 786,
      "زینه<space>": 787,
      "جمه": 788,
      "ذاکر": 789,
      "وم<space>": 790,
      "شاخص<space>": 791,
      "از<space>این<space>": 792,
      "مس": 793,
      "دس": 794,
      "در<space>روز<space>": 795,
      "ایر": 796,
      "بار<space>": 797,
      "ها<space>و<space>": 798,
      "خودرو<space>": 799,
      "قابل<space>": 800,
      "مبلغ<space>": 801,
      "سازی<space>": 802,
      "پایین<space>": 803,
      "شار<space>": 804,
      "وزار": 805,
      "دهای<space>": 806,
      "تحوی": 807,
      "جهان<space>": 808,
      "طلا<space>": 809,
      "اطلاع": 810,
      "یاب": 811,
      "uary<space>": 812,
      "باره<space>": 813,
      "به<space>ماه<space>": 814,
      "ارد<space>$<space>": 815,
      "شدن<space>": 816,
      "تری<space>": 817,
      "حس": 818,
      "ذخایر<space>": 819,
      "ق<space>به<space>": 820,
      "طقه<space>": 821,
      "زمان<space>": 822,
      "عملی": 823,
      "قف<space>": 824,
      "اسف": 825,
      "پرداخت<space>": 826,
      "پو": 827,
      "لین<space>": 828,
      "نب": 829,
      "جمو": 830,
      "بهم": 831,
      "بح": 832,
      "نوان<space>": 833,
      "توان": 834,
      "پذ": 835,
      "اوراق<space>": 836,
      "ng": 837,
      "طرح<space>": 838,
      "پایه<space>": 839,
      "تهران<space>": 840,
      "کنندگان<space>": 841,
      "تاث": 842,
      "بات<space>": 843,
      "ظرف": 844,
      "وزارت<space>": 845,
      "شامل<space>": 846,
      "گرفته<space>": 847,
      "محم": 848,
      "انو": 849,
      "اوپ": 850,
      "و<space>س": 851,
      "استف": 852,
      "چی": 853,
      "هزینه<space>": 854,
      "بهمن<space>": 855,
      "توافق<space>": 856,
      "عدد<space>": 857,
      "مین<space>": 858,
      "اگر<space>": 859,
      "استفاده<space>": 860,
      "باع": 861,
      "احتم": 862,
      "سطح<space>": 863,
      "د.<space>م": 864,
      "تف": 865,
      "یم.<space>": 866,
      "میلی": 867,
      "المل": 868,
      "تحویل<space>": 869,
      "کان": 870,
      "ردین<space>": 871,
      "فروردین<space>": 872,
      "بین<space>المل": 873,
      "نیم": 874,
      "<space>ماه<space>": 875,
      "عنوان<space>": 876,
      "همین<space>": 877,
      "نمای": 878,
      "s<space>": 879,
      "ادل<space>": 880,
      "اغاز<space>": 881,
      "ظرفیت<space>": 882,
      "عرب": 883,
      "کاری<space>": 884,
      "اینکه<space>": 885,
      "محصولات<space>": 886,
      "موضوع<space>": 887,
      "ملی<space>": 888,
      "از<space>ط": 889,
      "و<space>با<space>": 890,
      "سوی<space>": 891,
      "ابع<space>": 892,
      "اوپک<space>": 893,
      "ابتدای<space>": 894,
      "پول<space>": 895,
      "دان": 896,
      "بار": 897,
      "می<space>کن": 898,
      "قابل<space>م": 899,
      "پالایشگاه<space>": 900,
      "تای": 901,
      "ch": 902,
      "اع<space>": 903,
      "اسی": 904,
      "وره<space>": 905,
      "لا<space>": 906,
      "اردی": 907,
      "بود<space>و<space>": 908,
      "لح": 909,
      "<space>س": 910,
      "عربستان<space>": 911,
      "الی<space>که<space>": 912,
      "هد": 913,
      "تاری": 914,
      "عل": 915,
      "نا<space>": 916,
      "گران<space>": 917,
      "اصلی<space>": 918,
      "برخی<space>": 919,
      "باعث<space>": 920,
      "زیرا<space>": 921,
      "فولاد<space>": 922,
      "بهشت<space>": 923,
      "خرداد<space>": 924,
      "کمی": 925,
      "عامله<space>": 926,
      "سب": 927,
      "ابر<space>": 928,
      "روی": 929,
      "پیشن": 930,
      "تانول<space>": 931,
      "اط": 932,
      "پیشنه": 933,
      "ت<space>و<space>": 934,
      "e<space>": 935,
      "اردیبهشت<space>": 936,
      "ماهانه<space>": 937,
      "خالص<space>": 938,
      "فعالیت<space>": 939,
      "گاز": 940,
      "ابی<space>": 941,
      "اسی<space>": 942,
      "حص": 943,
      "ایج": 944,
      "ریق<space>": 945,
      "اکنون<space>": 946,
      "اظ": 947,
      "ایه<space>": 948,
      "دوم<space>": 949,
      "ember<space>": 950,
      "اذر<space>": 951,
      "l<space>": 952,
      "ایجاد<space>": 953,
      "تشر<space>": 954,
      "فی": 955,
      "ایع<space>": 956,
      "باشد.<space>": 957,
      "منطقه<space>": 958,
      "دم": 959,
      "گاز<space>طبی": 960,
      "شاهد<space>": 961,
      "د<space>و<space>": 962,
      "ابر": 963,
      "باد": 964,
      "اژ": 965,
      "لاح": 966,
      "لات<space>": 967,
      "ضی": 968,
      "مالی<space>": 969,
      "ه<space>به<space>": 970,
      "وارد<space>": 971,
      "همچنان<space>": 972,
      "شرایط<space>": 973,
      "رق": 974,
      "وضع": 975,
      "رای": 976,
      "گوی": 977,
      "دینگ": 978,
      "ارزش<space>م": 979,
      "ارات<space>": 980,
      "توضی": 981,
      "برق<space>": 982,
      "دارد.<space>": 983,
      "ترم<space>": 984,
      "فار": 985,
      "بسیار<space>": 986,
      "عامل<space>": 987,
      "نقدینگ": 988,
      "فق<space>به<space>": 989,
      "اسفند<space>": 990,
      "<space>-<space>": 991,
      "خبر<space>": 992,
      "چهار": 993,
      "خور": 994,
      "غیر": 995,
      "ویت<space>": 996,
      "ریت<space>": 997,
      "ادر<space>": 998,
      "امسال<space>": 999,
      "دست<space>": 1000,
      "ریان<space>": 1001,
      "هف": 1002,
      "همه<space>": 1003,
      "سام": 1004,
      "ری<space>": 1005,
      "ri": 1006,
      "می<space>کند<space>": 1007,
      "کشورهای<space>": 1008,
      "ویژه<space>": 1009,
      "بدون<space>": 1010,
      "تاثیر<space>": 1011,
      "وضعیت<space>": 1012,
      "عودی<space>": 1013,
      "زیر<space>": 1014,
      "یلات<space>": 1015,
      "تولید": 1016,
      "امی": 1017,
      "تسه": 1018,
      "<space>%-<space>": 1019,
      "ط<space>به<space>": 1020,
      "بعد<space>": 1021,
      "نه": 1022,
      "اورده<space>": 1023,
      "فوق<space>": 1024,
      "ند.": 1025,
      "بانکی<space>": 1026,
      "جم<space>": 1027,
      "mar": 1028,
      "شور": 1029,
      "عا<space>": 1030,
      "چند<space>": 1031,
      "ذاکرات<space>": 1032,
      "سنگ": 1033,
      "قرارداد<space>": 1034,
      "تجارت<space>": 1035,
      "t<space>": 1036,
      "هند<space>": 1037,
      "واق": 1038,
      "الب": 1039,
      "ثر<space>": 1040,
      "وس": 1041,
      "نفی<space>": 1042,
      "ان<space>در<space>": 1043,
      "ابت<space>": 1044,
      "حض": 1045,
      "<space>مبلغ<space>": 1046,
      "دم<space>": 1047,
      "غر": 1048,
      "+<space>": 1049,
      "توضیح<space>": 1050,
      "ضای<space>": 1051,
      "سهام": 1052,
      "حاض": 1053,
      "تیر<space>": 1054,
      "دیم<space>": 1055,
      "امات<space>": 1056,
      "ap": 1057,
      "داشت": 1058,
      "محدو": 1059,
      "خودرو": 1060,
      "خصوص<space>": 1061,
      "حقی": 1062,
      "ون<space>بش": 1063,
      "بالا": 1064,
      "حاضر<space>": 1065,
      "lng": 1066,
      "to": 1067,
      "خبر": 1068,
      "طب": 1069,
      "اجه<space>": 1070,
      "بود<space>که<space>": 1071,
      "وزه<space>": 1072,
      "کی<space>": 1073,
      "اتح": 1074,
      "ش<space>می<space>": 1075,
      "اند.<space>": 1076,
      "برابر<space>": 1077,
      "از<space>سوی<space>": 1078,
      "دهی<space>": 1079,
      "فروش<space>ماه": 1080,
      "میلیارد<space>": 1081,
      "حمای": 1082,
      "نبال<space>": 1083,
      "دهد.<space>": 1084,
      "هیچ": 1085,
      "فوب<space>": 1086,
      "ایل<space>": 1087,
      "عمل": 1088,
      "ازاد<space>": 1089,
      "بزرگ<space>": 1090,
      "حال<space>": 1091,
      "رییس<space>جمه": 1092,
      "تجاری<space>": 1093,
      "هر": 1094,
      "با<space>این<space>": 1095,
      "march": 1096,
      "می<space>رس": 1097,
      "حدا": 1098,
      "انها<space>": 1099,
      "juan": 1100,
      "شورای<space>": 1101,
      "کرد<space>که<space>": 1102,
      "نزدی": 1103,
      "ل<space>و<space>": 1104,
      "ادیه<space>": 1105,
      "<space>من": 1106,
      "هو": 1107,
      "نوس": 1108,
      "طه<space>": 1109,
      "تحلی": 1110,
      "اتحادیه<space>": 1111,
      "ریال": 1112,
      "عملیاتی<space>": 1113,
      "ان<space>به<space>": 1114,
      "شده<space>و<space>": 1115,
      "جمع<space>": 1116,
      "کنتر": 1117,
      "کم<space>": 1118,
      "تعداد<space>": 1119,
      "نیاز<space>": 1120,
      "شد": 1121,
      "تاریخ<space>": 1122,
      "پروژه<space>": 1123,
      "<space>با<space>": 1124,
      "جی<space>": 1125,
      "صنعتی<space>": 1126,
      "ارزی": 1127,
      "خوبی<space>": 1128,
      "خانه<space>": 1129,
      "اترین<space>": 1130,
      "براساس<space>": 1131,
      "بوط<space>به<space>": 1132,
      "یکی<space>از<space>": 1133,
      "ناش": 1134,
      "اوکر": 1135,
      "گزارش<space>ماه": 1136,
      "بالاترین<space>": 1137,
      "اتف": 1138,
      "البته<space>": 1139,
      "روغ": 1140,
      "کنیم<space>": 1141,
      "شناس": 1142,
      "حو": 1143,
      "منتشر<space>": 1144,
      "رسمی<space>": 1145,
      "یره<space>": 1146,
      "انس<space>": 1147,
      "صنایع<space>": 1148,
      "شش<space>": 1149,
      "ماهه<space>": 1150,
      "اش<space>": 1151,
      "ساخ": 1152,
      "همراه<space>": 1153,
      "پلی<space>": 1154,
      "شاهده<space>": 1155,
      "جهت<space>": 1156,
      "تاب": 1157,
      "کل": 1158,
      "درباره<space>": 1159,
      "ارزیابی<space>": 1160,
      "کمی<space>": 1161,
      "رقاب": 1162,
      "اجرای<space>": 1163,
      "اقدام<space>": 1164,
      "گفته<space>": 1165,
      "اطلاعات<space>": 1166,
      "نیست<space>": 1167,
      "شرق<space>": 1168,
      "اصلاح": 1169,
      "se": 1170,
      "ون<space>و<space>": 1171,
      "فصل<space>": 1172,
      "وق": 1173,
      "ارایه<space>": 1174,
      "€<space>": 1175,
      "سیر<space>": 1176,
      "به<space>طور<space>": 1177,
      "جموع<space>": 1178,
      "شهری": 1179,
      "میانه<space>": 1180,
      "کالاه": 1181,
      "سخ": 1182,
      "محموله<space>": 1183,
      "ایسه<space>": 1184,
      "ع<space>م": 1185,
      "مجمو": 1186,
      "اقی<space>": 1187,
      "به<space>این<space>": 1188,
      "مثبت<space>": 1189,
      "fe": 1190,
      "ساع": 1191,
      "اشیه<space>": 1192,
      "بادله<space>": 1193,
      "عملکرد<space>": 1194,
      "داشت.<space>": 1195,
      "کس": 1196,
      "فراورده<space>": 1197,
      "de": 1198,
      "نفت<space>و<space>": 1199,
      "اسل": 1200,
      "است.<space>لاز": 1201,
      "متانول<space>": 1202,
      "گست": 1203,
      "حمایت<space>": 1204,
      "بازار": 1205,
      "شم<space>": 1206,
      "گفت": 1207,
      "تور<space>": 1208,
      "ون<space>تن<space>": 1209,
      "روغن<space>": 1210,
      "صادراتی<space>": 1211,
      "بالا<space>": 1212,
      "مصرف<space>": 1213,
      "برنت<space>": 1214,
      "رقم<space>": 1215,
      "حد<space>": 1216,
      "br": 1217,
      "cf": 1218,
      "دریافت<space>": 1219,
      "ابان<space>": 1220,
      "سامانه<space>": 1221,
      "ون<space>$<space>": 1222,
      "مورد<space>": 1223,
      "تس": 1224,
      "شد<space>و<space>": 1225,
      "الا<space>": 1226,
      "تهی<space>به<space>": 1227,
      "اوکراین<space>": 1228,
      "ly<space>": 1229,
      "شهریور<space>": 1230,
      "مرک": 1231,
      "گرد<space>": 1232,
      "پاس": 1233,
      "<space>مر": 1234,
      "ضا<space>": 1235,
      "مالی": 1236,
      "هدف<space>": 1237,
      "مهم<space>": 1238,
      "جی": 1239,
      "اهن<space>": 1240,
      "حجم<space>": 1241,
      "را<space>با<space>": 1242,
      "کنترل<space>": 1243,
      "عمو": 1244,
      "جنوب<space>": 1245,
      "ثابت<space>": 1246,
      "تمام<space>": 1247,
      "شب": 1248,
      "شرو": 1249,
      "نخ": 1250,
      "امور<space>": 1251,
      "خاور": 1252,
      "عدم<space>": 1253,
      "تعط": 1254,
      "جلسه<space>": 1255,
      "اهی<space>": 1256,
      "نزدیک<space>": 1257,
      "تصمی": 1258,
      "دارایی<space>": 1259,
      "برج": 1260,
      "apri": 1261,
      "تحت<space>": 1262,
      "ها<space>به<space>": 1263,
      "تحلیل<space>": 1264,
      "عراق<space>": 1265,
      "یین<space>": 1266,
      "اورد<space>": 1267,
      "سته<space>ای<space>": 1268,
      "هفت": 1269,
      "تعیین<space>": 1270,
      "قان": 1271,
      "مکن<space>": 1272,
      "ندی<space>": 1273,
      "سنگ<space>": 1274,
      "نگر": 1275,
      "ختل": 1276,
      "بیشترین<space>": 1277,
      "داد": 1278,
      "ثبات<space>": 1279,
      "در<space>سال": 1280,
      "افی<space>": 1281,
      "july<space>": 1282,
      "یف<space>": 1283,
      "جریان<space>": 1284,
      "<space>را<space>": 1285,
      "اولین<space>": 1286,
      "گذار": 1287,
      "no": 1288,
      "سمت<space>": 1289,
      "ناخ": 1290,
      "خارجه<space>": 1291,
      "می<space>رود<space>": 1292,
      "خاورمیانه<space>": 1293,
      "هیچ<space>": 1294,
      "زمانی<space>": 1295,
      "تسهیلات<space>": 1296,
      "قانون<space>": 1297,
      "febr": 1298,
      "نیرو": 1299,
      "نتی": 1300,
      "ازه<space>": 1301,
      "اسرای": 1302,
      "حاشیه<space>": 1303,
      "کمتر<space>": 1304,
      "رقابت<space>": 1305,
      "بوده<space>و<space>": 1306,
      "<space>واحد<space>": 1307,
      "لو": 1308,
      "جنوبی<space>": 1309,
      "ترکیه<space>": 1310,
      "کی": 1311,
      "تحلیل": 1312,
      "زو": 1313,
      "jan": 1314,
      "دوره<space>": 1315,
      "بزرگترین<space>": 1316,
      "عمل<space>": 1317,
      "چشم<space>": 1318,
      "سکه<space>": 1319,
      "نتیجه<space>": 1320,
      "داد.<space>": 1321,
      "کر<space>": 1322,
      "زاری<space>": 1323,
      "پوشش<space>": 1324,
      "خاص": 1325,
      "اون<space>": 1326,
      "ازای<space>": 1327,
      "توقف<space>": 1328,
      "دور<space>": 1329,
      "مجل": 1330,
      "کانال<space>": 1331,
      "زیادی<space>": 1332,
      "کره<space>": 1333,
      "فل": 1334,
      "دنی": 1335,
      "ریال<space>و<space>": 1336,
      "قل": 1337,
      "کنند.<space>": 1338,
      "صد<space>": 1339,
      "february<space>": 1340,
      "جو": 1341,
      "نمی<space>": 1342,
      "اولیه<space>": 1343,
      "حف": 1344,
      "ناخالص<space>": 1345,
      "ر<space>به<space>": 1346,
      "<space>مع": 1347,
      "شمال<space>": 1348,
      "ها<space>را<space>": 1349,
      "oc": 1350,
      "شمش<space>": 1351,
      "march<space>": 1352,
      "اتیل": 1353,
      "طبق<space>": 1354,
      "علی<space>": 1355,
      "حه<space>": 1356,
      "ندار": 1357,
      "اوه<space>": 1358,
      "فارس<space>": 1359,
      "قق<space>": 1360,
      "تصمیم<space>": 1361,
      "بهبود<space>": 1362,
      "a<space>": 1363,
      "یز<space>": 1364,
      "امک": 1365,
      "جمله<space>": 1366,
      "کردن<space>": 1367,
      "january<space>": 1368,
      "خرد<space>": 1369,
      "گونه<space>": 1370,
      "کمک<space>": 1371,
      "انتشار<space>": 1372,
      "مک": 1373,
      "کد": 1374,
      "برس": 1375,
      "نفت": 1376,
      "فصلی<space>": 1377,
      "اعتب": 1378,
      "رات<space>": 1379,
      "پیدا<space>": 1380,
      "pt": 1381,
      "همکاری<space>": 1382,
      "فق": 1383,
      "تغییر": 1384,
      "روز": 1385,
      "خریداران<space>": 1386,
      "فشار<space>": 1387,
      "بازگ": 1388,
      "<space>سال<space>": 1389,
      "باقی<space>": 1390,
      "تاک": 1391,
      "عض": 1392,
      "ریس": 1393,
      "پیش": 1394,
      "مه": 1395,
      "کشتی<space>": 1396,
      "دان<space>": 1397,
      "که<space>به<space>": 1398,
      "اور<space>": 1399,
      "پارس<space>": 1400,
      "سایر<space>": 1401,
      "us": 1402,
      "اتیلن<space>": 1403,
      "ض<space>": 1404,
      "توانسته<space>": 1405,
      "خدم": 1406,
      "مجلس<space>": 1407,
      "که<space>این<space>": 1408,
      "دولتی<space>": 1409,
      "نقدینگی<space>": 1410,
      "منابع<space>": 1411,
      "یو": 1412,
      "نیمه<space>": 1413,
      "عمومی<space>": 1414,
      "cfr<space>": 1415,
      "حصولات<space>": 1416,
      "رو<space>": 1417,
      "زمی": 1418,
      "دستور": 1419,
      "نگرانی<space>": 1420,
      "حقو": 1421,
      "امو": 1422,
      "شده<space>در<space>": 1423,
      "ساعت<space>": 1424,
      "پی<space>": 1425,
      "سپر": 1426,
      "دستگاه<space>": 1427,
      "دهد<space>": 1428,
      "رینگ<space>": 1429,
      "ام<space>م": 1430,
      "حرک": 1431,
      "مردم<space>": 1432,
      "دریای<space>": 1433,
      "هنو": 1434,
      "امار<space>": 1435,
      "نشست<space>": 1436,
      "پالایش<space>": 1437,
      "اژانس<space>": 1438,
      "سهامداران<space>": 1439,
      "خلی": 1440,
      "lng<space>": 1441,
      "juan<space>": 1442,
      "dece": 1443,
      "قیمتی<space>": 1444,
      "تلاش<space>": 1445,
      "کلی": 1446,
      "دل": 1447,
      "میان<space>": 1448,
      "یک<space>م": 1449,
      "یلی<space>": 1450,
      "سر<space>": 1451,
      "صادر<space>": 1452,
      "براورد<space>": 1453,
      "سیم": 1454,
      "ان<space>و<space>": 1455,
      "انات<space>": 1456,
      "تنها<space>": 1457,
      "شد.": 1458,
      "خواهند<space>": 1459,
      "هفته<space>من": 1460,
      "پن": 1461,
      "کرد<space>و<space>": 1462,
      "ون<space>برگ": 1463,
      "بعد<space>از<space>": 1464,
      "بسیاری<space>": 1465,
      "الو": 1466,
      "تاکید<space>": 1467,
      "عیت<space>": 1468,
      "ابق<space>": 1469,
      "من<space>": 1470,
      "octo": 1471,
      "می<space>شو": 1472,
      "داشت<space>و<space>": 1473,
      "افر": 1474,
      "دید": 1475,
      "دیت<space>": 1476,
      "بهاد": 1477,
      "sept": 1478,
      "عنی<space>": 1479,
      "اوپک<space>پل": 1480,
      "گستر": 1481,
      "نی<space>بر<space>": 1482,
      "سالانه<space>": 1483,
      "الت<space>": 1484,
      "گذار<space>": 1485,
      "سقف<space>": 1486,
      "ورود<space>": 1487,
      "اوت<space>": 1488,
      "کالاهای<space>": 1489,
      "اقتصاد": 1490,
      "یعنی<space>": 1491,
      "سوم<space>": 1492,
      "از<space>نظر<space>": 1493,
      "مب": 1494,
      "دوشنبه<space>": 1495,
      "ان<space>را<space>": 1496,
      "به<space>مدت<space>": 1497,
      "in": 1498,
      "لحاظ": 1499,
      "april<space>": 1500,
      "در<space>نمو": 1501,
      "ضعیف<space>": 1502,
      "<space>سنت<space>": 1503,
      "زمستان<space>": 1504,
      "خواهیم<space>": 1505,
      "حقیقی<space>": 1506,
      "سعودی<space>": 1507,
      "قت<space>": 1508,
      "خوب<space>": 1509,
      "اسراییل<space>": 1510,
      "منفی<space>": 1511,
      "<space>%+<space>": 1512,
      "حتی<space>": 1513,
      "هستند<space>": 1514,
      "برجام<space>": 1515,
      "ریال<space>بود": 1516,
      "شاهده<space>است.": 1517,
      "سیون<space>": 1518,
      "پذیر": 1519,
      "ترکی": 1520,
      "فعالان<space>": 1521,
      "قل<space>": 1522,
      "ارت": 1523,
      "شبکه<space>": 1524,
      "october<space>": 1525,
      "به<space>نظر<space>": 1526,
      "جزی": 1527,
      "مذاکرات<space>": 1528,
      "حضور<space>": 1529,
      "december<space>": 1530,
      "فعلی<space>": 1531,
      "شد<space>که<space>": 1532,
      "سل": 1533,
      "اخر<space>": 1534,
      "سپرده<space>": 1535,
      "خارجی<space>": 1536,
      "september<space>": 1537,
      "غیر<space>": 1538,
      "یز": 1539,
      "شروع<space>": 1540,
      "جنگ<space>": 1541,
      "نقل<space>": 1542,
      "نقدی<space>": 1543,
      "قایسه<space>": 1544,
      "nov": 1545,
      "اجرایی<space>": 1546,
      "ختلف<space>": 1547,
      "منظ": 1548,
      "خلیج<space>": 1549,
      "کمیسیون<space>": 1550,
      "مست": 1551,
      "انتق": 1552,
      "چک<space>": 1553,
      "<space>قابل<space>م": 1554,
      "گوگرد<space>": 1555,
      "تقویت<space>": 1556,
      "حدو": 1557,
      "اختل": 1558,
      "بلو": 1559,
      "خوراک<space>": 1560,
      "الک": 1561,
      "چشم<space>اند": 1562,
      "شف": 1563,
      "<space>روز<space>": 1564,
      "میت<space>": 1565,
      "ترتی": 1566,
      "ma": 1567,
      "یان<space>": 1568,
      "اوراق<space>بهاد": 1569,
      "قیر<space>": 1570,
      "عات<space>": 1571,
      "یکی<space>": 1572,
      "فدر": 1573,
      "کنند<space>": 1574,
      "صی<space>": 1575,
      "شای": 1576,
      "کامل<space>": 1577,
      "%<space>": 1578,
      "صرف": 1579,
      "تولیدکنندگان<space>": 1580,
      "اله<space>": 1581,
      "نیست": 1582,
      "تواند<space>": 1583,
      "پول": 1584,
      "خرو": 1585,
      "بیت<space>": 1586,
      "ساله<space>": 1587,
      "می<space>توان": 1588,
      "نشده<space>": 1589,
      "<space>b": 1590,
      "عب<space>": 1591,
      "رفته<space>": 1592,
      "ممکن<space>": 1593,
      "عضو<space>": 1594,
      "گازوی": 1595,
      "ش<space>های<space>": 1596,
      "کیل": 1597,
      "اشاره<space>": 1598,
      "شه<space>": 1599,
      "دیل<space>": 1600,
      "موج": 1601,
      "احتمالا<space>": 1602,
      "<space>ت": 1603,
      "صح": 1604,
      "مواد<space>": 1605,
      "وا": 1606,
      "زد<space>": 1607,
      "غرب<space>": 1608,
      "نخست<space>": 1609,
      "هفتگی<space>": 1610,
      "رکورد<space>": 1611,
      "گری<space>": 1612,
      "جای": 1613,
      "فدرال<space>": 1614,
      "علیه<space>": 1615,
      "صه<space>": 1616,
      "حرکت<space>": 1617,
      "اروپ": 1618,
      "حموله<space>": 1619,
      "خارج<space>": 1620,
      "november<space>": 1621,
      "کارخانه<space>": 1622,
      "نک": 1623,
      "محدوده<space>": 1624,
      "ق<space>م": 1625,
      "اوری<space>": 1626,
      "هنوز<space>": 1627,
      "یمی": 1628,
      "دهم<space>": 1629,
      "برگزاری<space>": 1630,
      "استر": 1631,
      "محدود<space>": 1632,
      "c<space>": 1633,
      "مدیریت<space>": 1634,
      "تعه": 1635,
      "خص<space>": 1636,
      "d<space>": 1637,
      "منظور<space>": 1638,
      "بنا<space>": 1639,
      "خدمات<space>": 1640,
      "بنی": 1641,
      "اگر": 1642,
      "پنج": 1643,
      "تصوی": 1644,
      "gus": 1645,
      "هزار<space>": 1646,
      "نفتا<space>": 1647,
      "اسلامی<space>": 1648,
      "خط<space>": 1649,
      "گرم<space>": 1650,
      "اصلاح<space>": 1651,
      "بسته<space>": 1652,
      "بخش": 1653,
      "است<space>در<space>": 1654,
      "تقری": 1655,
      "ظه<space>": 1656,
      "لن<space>": 1657,
      "امنی": 1658,
      "<space>هم": 1659,
      "بالای<space>": 1660,
      "معادل<space>": 1661,
      "نفت<space>در<space>": 1662,
      "چهارشنبه<space>": 1663,
      "رکن": 1664,
      "زمینه<space>": 1665,
      "بالاتر<space>": 1666,
      "م<space>م": 1667,
      "ام<space>می<space>": 1668,
      "مال<space>": 1669,
      "ابل": 1670,
      "تحولات<space>": 1671,
      "مسکن<space>": 1672,
      "مط": 1673,
      "گازوییل<space>": 1674,
      "گران": 1675,
      "قبل<space>از<space>": 1676,
      "هستند.<space>": 1677,
      "به<space>سال<space>": 1678,
      "<space>l": 1679,
      "کرده<space>و<space>": 1680,
      "ارد<space>ریال": 1681,
      "شناسایی<space>": 1682,
      "صف": 1683,
      "au": 1684,
      "حساب<space>": 1685,
      "اج<space>": 1686,
      "چند": 1687,
      "<space>حدود<space>": 1688,
      "اقدامات<space>": 1689,
      "المان<space>": 1690,
      "بهار<space>": 1691,
      "ا<space>در<space>": 1692,
      "چهار<space>": 1693,
      "می<space>رسد<space>": 1694,
      "طرف<space>": 1695,
      "پولی<space>": 1696,
      "راست": 1697,
      "صادرکن": 1698,
      "را<space>از<space>": 1699,
      "عو": 1700,
      "کشاور": 1701,
      "معاملاتی<space>": 1702,
      "باز<space>": 1703,
      "دد<space>": 1704,
      "شت": 1705,
      "خز": 1706,
      "عمده<space>": 1707,
      "بود.": 1708,
      "نگوی<space>": 1709,
      "که<space>از<space>": 1710,
      "پیشنهاد<space>": 1711,
      "ترتیب<space>": 1712,
      "شرکت": 1713,
      "تال": 1714,
      "رفت<space>": 1715,
      "ابط<space>": 1716,
      "عی": 1717,
      "سهامی<space>": 1718,
      "تقریبا<space>": 1719,
      "حقوقی<space>": 1720,
      "طلای<space>": 1721,
      "اصل<space>": 1722,
      "حمله<space>": 1723,
      "تصویب<space>": 1724,
      "کوت": 1725,
      "امکان<space>": 1726,
      "اساس": 1727,
      "با<space>رشد<space>": 1728,
      "دیر<space>": 1729,
      "دارهای<space>": 1730,
      "<space>مواجه<space>": 1731,
      "خروج<space>": 1732,
      "یم.": 1733,
      "فدرال<space>ر": 1734,
      "نهایی<space>": 1735,
      "نوسان<space>": 1736,
      "فضای<space>": 1737,
      "حر": 1738,
      "دارند<space>": 1739,
      "جمهوری<space>": 1740,
      "بیشتری<space>": 1741,
      "عق": 1742,
      "تراز<space>": 1743,
      "پیلن<space>": 1744,
      "است<space>تا<space>": 1745,
      "صر": 1746,
      "مکعب<space>": 1747,
      "سخنگوی<space>": 1748,
      "حجم": 1749,
      "ربه<space>": 1750,
      "<space>میزان<space>": 1751,
      "شیمی": 1752,
      "خط": 1753,
      "راه<space>اند": 1754,
      "اتفاق": 1755,
      "ریسک<space>": 1756,
      "که<space>با<space>": 1757,
      "فراب": 1758,
      "بیم": 1759,
      "تخص": 1760,
      "لت<space>": 1761,
      "معاون<space>": 1762,
      "بودن<space>": 1763,
      "می<space>باش": 1764,
      "دارد<space>و<space>": 1765,
      "کو<space>": 1766,
      "نرخ": 1767,
      "قطر<space>": 1768,
      "ارز<space>و<space>": 1769,
      "کردند.<space>": 1770,
      "استان<space>": 1771,
      "رعامل<space>": 1772,
      "اپور<space>": 1773,
      "تث": 1774,
      "بدهی<space>": 1775,
      "فه": 1776,
      "لادی<space>": 1777,
      "در<space>چین<space>": 1778,
      "شهر<space>": 1779,
      "فرابور": 1780,
      "دیده<space>": 1781,
      "حداقل<space>": 1782,
      "سنگین<space>": 1783,
      "امریکایی<space>": 1784,
      "گل": 1785,
      "تولیدی<space>": 1786,
      "en": 1787,
      "فروش": 1788,
      "برداری<space>": 1789,
      "یک<space>میلی": 1790,
      "اخبار<space>": 1791,
      "یابد.<space>": 1792,
      "ستی<space>": 1793,
      "سیاسی<space>": 1794,
      "امیدو": 1795,
      "رکز<space>": 1796,
      "سرانه<space>": 1797,
      "تعمی": 1798,
      "بحران<space>": 1799,
      "شکل<space>": 1800,
      "عت<space>": 1801,
      "حوزه<space>": 1802,
      "<space>$": 1803,
      "سفار": 1804,
      "فن": 1805,
      "augus": 1806,
      "احتمال<space>": 1807,
      "تابستان<space>": 1808,
      "فدرال<space>رزر": 1809,
      "اغ<space>": 1810,
      "اختی": 1811,
      "حل<space>": 1812,
      "فعال<space>": 1813,
      "داشته<space>باش": 1814,
      "می<space>گوی": 1815,
      "پاسخ<space>": 1816,
      "ارد<space>و<space>": 1817,
      "رکز<space>م": 1818,
      "یار": 1819,
      "رت": 1820,
      "از<space>سال<space>": 1821,
      "th": 1822,
      "یات<space>": 1823,
      "مرداد<space>": 1824,
      "اسکن": 1825,
      "مز<space>": 1826,
      "ارگو": 1827,
      "کلی<space>": 1828,
      "لحظه<space>": 1829,
      "امار": 1830,
      "نگاه<space>": 1831,
      "ره": 1832,
      "زغ": 1833,
      "در<space>سه<space>": 1834,
      "بور<space>": 1835,
      "لازم<space>": 1836,
      "صوبه<space>": 1837,
      "برگزار<space>": 1838,
      "عملیات<space>": 1839,
      "رگ": 1840,
      "سرمایه<space>گذار": 1841,
      "رع": 1842,
      "پایانی<space>": 1843,
      "بازگشت<space>": 1844,
      "سفر<space>": 1845,
      "افت": 1846,
      "قوی<space>": 1847,
      "نبه<space>": 1848,
      "انتظارات<space>": 1849,
      "نکته<space>": 1850,
      "شماره<space>": 1851,
      "حله<space>": 1852,
      "بر<space>این<space>": 1853,
      "قرار<space>گرف": 1854,
      "fo": 1855,
      "اقصه<space>": 1856,
      "حذ": 1857,
      "ti": 1858,
      "دف": 1859,
      "رک<space>": 1860,
      "فرابورس<space>": 1861,
      "تثبیت<space>": 1862,
      "واقع<space>": 1863,
      "تایید<space>": 1864,
      "صعودی<space>": 1865,
      "مس<space>": 1866,
      "هر<space>سهم<space>": 1867,
      "اطلاع<space>": 1868,
      "تفاوت<space>": 1869,
      "اول": 1870,
      "ا<space>و<space>": 1871,
      "قیمت<space>$<space>": 1872,
      "نیز<space>م": 1873,
      "از<space>لحاظ": 1874,
      "روابط<space>": 1875,
      "راه": 1876,
      "تحلیلگران<space>": 1877,
      "دستور<space>": 1878,
      "سیز": 1879,
      "زیان<space>": 1880,
      "ایرانی<space>": 1881,
      "دوباره<space>": 1882,
      "دلیل<space>": 1883,
      "ال<space>م": 1884,
      "گند": 1885,
      "pe": 1886,
      "اماده<space>": 1887,
      "کوتاه<space>": 1888,
      "ظ<space>": 1889,
      "ژاپ": 1890,
      "الیات<space>": 1891,
      "قبلی<space>": 1892,
      "داوم<space>": 1893,
      "مانند<space>": 1894,
      "may<space>": 1895,
      "اروپایی<space>": 1896,
      "تار<space>": 1897,
      "بن<space>": 1898,
      "العمل<space>": 1899,
      "گفت<space>و": 1900,
      "حمل<space>": 1901,
      "انتقال<space>": 1902,
      "بهای<space>": 1903,
      "صمت<space>": 1904,
      "ها<space>از<space>": 1905,
      "ساخت<space>": 1906,
      "جام": 1907,
      "خود<space>در<space>": 1908,
      "ورق<space>": 1909,
      "پیشنهاد": 1910,
      "چرا<space>": 1911,
      "پلی": 1912,
      "کردند<space>": 1913,
      "نام<space>": 1914,
      "پلت": 1915,
      "بع<space>": 1916,
      "فی<space>": 1917,
      "داریم<space>": 1918,
      "نیز<space>به<space>": 1919,
      "یکش": 1920,
      "سیمان<space>": 1921,
      "خودروهای<space>": 1922,
      "re": 1923,
      "قدر": 1924,
      "on": 1925,
      "حداک": 1926,
      "حاک": 1927,
      "سنگاپور<space>": 1928,
      "نظام<space>": 1929,
      "اعمال<space>": 1930,
      "پ<space>": 1931,
      "داتی<space>": 1932,
      "بیمه<space>": 1933,
      "به<space>م": 1934,
      "تولیدکننده<space>": 1935,
      "نفر<space>": 1936,
      "خواست<space>": 1937,
      "افری": 1938,
      "لای": 1939,
      "دولت<space>سیز": 1940,
      "پروپیلن<space>": 1941,
      "ایبنا<space>": 1942,
      "این<space>م": 1943,
      "زایده<space>": 1944,
      "هم<space>و<space>": 1945,
      "تبدیل<space>": 1946,
      "یارانه<space>": 1947,
      "شدید<space>": 1948,
      "کور<space>": 1949,
      "اهم<space>": 1950,
      "افز": 1951,
      "دیز": 1952,
      "کمترین<space>": 1953,
      "گیر<space>": 1954,
      "<space>نسبت<space>": 1955,
      "اضاف": 1956,
      "شان<space>": 1957,
      "نظارت<space>": 1958,
      "کدال<space>": 1959,
      "بان<space>": 1960,
      "در<space>بخش<space>": 1961,
      "m<space>": 1962,
      "زنج": 1963,
      "کام": 1964,
      "مر<space>": 1965,
      "پذیر<space>": 1966,
      "چر": 1967,
      "توجه": 1968,
      "دیدی<space>": 1969,
      "منج": 1970,
      "یکشنبه<space>": 1971,
      "اندو": 1972,
      "رکود<space>": 1973,
      "او<space>": 1974,
      "دستورالعمل<space>": 1975,
      "خل": 1976,
      "کارشن": 1977,
      "یابد<space>": 1978,
      "طول<space>": 1979,
      "جزییات<space>": 1980,
      "سری<space>": 1981,
      "نخواهد<space>": 1982,
      "حمل<space>و<space>": 1983,
      "کاهشی<space>": 1984,
      "بندی<space>": 1985,
      "افراد<space>": 1986,
      "لوله<space>": 1987,
      "در<space>نظر<space>": 1988,
      "اداره<space>": 1989,
      "جلو": 1990,
      "ذخیره<space>": 1991,
      "فو": 1992,
      "سرعت<space>": 1993,
      "کشاورزی<space>": 1994,
      "رفع<space>": 1995,
      "مالیاتی<space>": 1996,
      "دام": 1997,
      "اجرا<space>": 1998,
      "بحث<space>": 1999,
      "ریه<space>": 2000,
      "اظه": 2001,
      "حق<space>": 2002,
      "ذکور<space>": 2003,
      "ریزی<space>": 2004,
      "بایدن<space>": 2005,
      "تجربه<space>": 2006,
      "جمعه<space>": 2007,
      "مقداری<space>": 2008,
      "س<space>م": 2009,
      "رسید<space>و<space>": 2010,
      "بنابر": 2011,
