{"id": 94823, "date": "2022-07-14T11:09:39", "text": ", گروه سیاست - محمد مهاجرانی در 23 تیر 1394 برنامه جامع اقدام مشترک موسوم به برجام به امضای ایران و اعضای شورای امنیت سازمان ملل متحد و آلمان رسید. در این توافق نامه ی بین المللی, مقرر شده بود که در ازای محدودیت های گسترده در برنامه صلح آمیز هسته ای کشورمان, همه ی تحریم های غیرقانونی کشورهای غربی به سرکردگی ایالات متحده لغو شود. اما در نهایت چند ماه پس از روی کار آمدن دونالد ترامپ به عنوان رئیس جمهور آمریکا, وی به صورت یکجانبه از آن خارج شد. برجام که تقریباً به اندازه عُمر دولت مصدق زیست داشت, بار دیگر نشان داد, اعتماد به غرب به ویژه آمریکا و اطمینان از وعده های آن ها می تواند تا چه اندازه مخرب باشد. در این گزارش بنا داریم به مناسبت هفتمین سالگرد امضای برجام با استفاده از بیانات و نکات تحلیلی که در سال های اخیر توسط حضرت آیت الله خامنه ای رهبر انقلاب مورد تصریح و تاکید قرار گرفته است به بخشی از سوالات مهم پیرامون برجام پاسخ دهیم. 1- آیا دیپلماسی جمهوری اسلامی ایران باید صرفاً بر حل موضوع هسته ای متمرکز شود؟ دیپلماسی را تحت تأثیر مسئله ی هسته ای هم نباید قرار داد؛ یعنی این جور نباشد که دیپلماسیِ کشور متّصل به قضیّه ی هسته ای باشد؛ نه, قضیّه ی هسته ای یک قضیّه ی جداگانه ای است که آن را باید به یک شکل مناسب و شایسته ی کشور حل کنند, امّا دایره ی دیپلماسی خیلی وسیع تر است. در قضیّه ی هسته ای, آمریکایی ها انصافاً وقاحت را از حد گذرانده اند؛ واقعاً وقاحت را از حد گذرانده اند جلوی چشم همه از برجام خارج شدند, حالا جوری حرف می زنند انگاری که ایران از برجام خارج شده, جوری طلبکاری می کنند که انگار ما تعهّدات را به هم زده ایم مدّت ها در مقابل این حرکت آمریکایی ها هیچ حرکتی از طرف ایران انجام نگرفت؛ بعد از گذشت مدّتی, با اعلام, با توجّه, برخی از تعهّدات کنار گذاشته شد؛ برخی, نه همه. آنها به تعهّدشان عمل نکردند. بیانات در نخستین دیدار رئیس جمهور و اعضای هیئت دولت سیزدهم 6 6 1400 2- اروپایی ها در عهدشکنی آمریکا سهیم هستند؟ اروپایی ها هم از لحاظ عهدشکنی و بداخلاقی کمتر از آمریکا نیستند؛ آنها هم مثل آمریکایند لکن در مقام زبان بازی و حرف زدن طلبکارند؛ همیشه طلبکارند. گویا این ما بودیم که مدّت ها مذاکره را به مسخره گرفتیم و تعهّداتمان را زیر پا گذاشتیم و عمل نکردیم؛ این کاری است که آنها کردند. بیانات در نخستین دیدار رئیس جمهور و اعضای هیئت دولت سیزدهم 6 6 1400 اروپا یازده تعهّد در مقابل ایران, در قضیّه ی برجام داشته و به هیچکدام از این یازده تعهّد عمل نکرده؛ یعنی این حرفی است که وزیر خارجه ی ما دارد می گوید؛ وزیر خارجه خُب معمولاً ملاحظات دیپلماتیک دارند. گزیده ای از بیانات در دیدار ائمه جمعه سراسر کشور 25 4 1398 در قضیّه ی برجام, وظیفه ی اروپایی ها چه بود؟ یک طرف که آمریکا است خارج شد؛ وظیفه ی طرف های دیگر چه بود؟ وظیفه ی اروپایی ها این بود که می ایستادند در مقابل آمریکا, می گفتند ما به تعهّد خودمان پایبندیم؛ تعهّد آنها این بود که تحریم ها به طور کلّی برداشته بشود؛ باید محکم می ایستادند, [امّا] با بهانه های مختلف نَایستادند. علاوه بر اینکه در مقابل آمریکا نَایستادند, خودشان هم در عین اینکه مدام به ما تأکید کردند و می کنند که مبادا از برجام خارج بشوید,عملاً از برجام خارج شده اند؛ یعنی حتّی تحریم های جدیدی را علیه ایران به وجود آورده اند. این رفتار اروپایی ها است؛ از اینها می شود توقّع داشت؟ بیانات در اجتماع زائران و مجاوران حرم مطهر رضوی 1 1 1398 3- تفاوتی بین مطالبات برجامی دولت بایدن و ترامپ وجود دارد؟ دولت کنونی آمریکا هم هیچ فرقی با دولت قبلی ندارد؛ یعنی همین چیزی که الان اینها در زمینه ی مسائل هسته ای از ایران مطالبه می کنند, همان چیزی است که ترامپ مطالبه می کرد, که آن روز مسئولین بالای دولتی می گفتند که امکان ندارد, عاقلانه نیست و مانند اینها. اینها همان را می خواهند؛ هیچ تفاوتی نکرده. او با یک زبان می گفت, اینها با یک زبان دیگری میگویند. باید به اینها توجّه کرد. بیانات در نخستین دیدار رئیس جمهور و اعضای هیئت دولت سیزدهم 6 6 1400 4- چرا مذاکرات اخیر برای احیای برجام بی نتیجه است؟ آمریکایی ها بر سر موضع عناد آمیز خودشان محکم ایستادند و یک قدم جلو نیامدند. روی کاغذ یا در مقام وعده می گویند بله, ما تحریم ها را برمی داریم, [امّا] برنداشتند و برنمی دارند هم؛ شرط می گذارند؛ می گویند اگر می خواهید تحریم ها برداشته بشود, باید الان در همین توافق یک جمله ای را بگنجانید که این جمله به معنای آن باشد که بعداً باید درباره ی این موضوعات با شما صحبت کنیم و توافق کنیم؛ اگر چنانچه این جمله را نگنجانید ما الان با همدیگر توافقی نخواهیم داشت.", "label": "منفی"}
{"id": 102348, "date": "2022-07-23T10:22:25", "text": ",آخرین مهلت ارائه اظهارنامه مالیات بر اجاره براساس اعلام سازمان امور مالیاتی, اشخاص حقوقی و صاحبان درآمد املاک اجاری تا پایان برای ارائه اظهارنامه فرصت دارند. درآمد مشمول مالیات املاکی که به اجاره گذاشته می شوند, عبارت است از کل مال الاجاره اعم از نقدی و غیرنقدی پس از کسر 25 درصد بابت هزینه ها و استهلاکات و تعهدات مالک نسبت به مورد اجاره؛ بنابراین 75 درصد درآمد اجاره املاک مشمول مالیات بوده و 25 درصد آن معاف از مالیات است.  134690", "label": "منفی"}
{"id": 232773, "date": "2023-06-11T14:31:39", "text": ",بازار حداقل از دیروز کمی عاقلانه تر, آهسته تر و کم هیجان تر رفتار کرد و فشار فروش را در آستانه مرز 2.2 کمتر دید. هرچند برخی چارتیست ها معتقدند بازار آنجایی که نباید می ریخت, ریخت و حالا افت های احتمالی و اصلاح زمانی گریزناپذیر است. مشکل بازار این بود که در عین اینکه معاملاتی یکپارچه منفی نداشت و به شدت منفی دیروز نبود, اما حجم همچنان پایین و غیرمنطقی پیش می رفت و این کم حجمی عاملی برای افزایش تعداد تماشاچی های بازار به جای فعالان خواهد بود.,ارزش کل معاملات بازار 10.999 میلیارد تومان بود که از این مبلغ, 7479 میلیارد تومان آن مربوط به معاملات خرد سهام و صندوق های قابل معامله سهامی بوده که عددی کمتر حتی از دیروز است و این موضوع, نقطه ضعف بازار این روزها محسوب می شود. بازار را در حالی آغاز کردیم که به نظر بسیاری, بازار این روزها اسیر ترس شده و تردید توافق و عدم توافق و احتمال ادامه افت دلار بر این ترس دامن زده است. اگر از بسیاری سوال کنید که بازار چه زمانی به مسیر درست خود باز می گردد, همگان بر این عقیده اند زمانی که هیجان خرید بر ترس غلبه کند و خیال بازار از تحولات اطراف و اتفاقات راحت شود, بازار می تواند جریان قوی تری را بگیرد و در عین ارزندگی, فضای منطقی قیمتی را نیز پیش ببرد. اما این ترس ها چیست و آیا جنبه واقعی دارد یا خیر؟ دیروز از یک ترس تاریخی صحبت کردیم که هنگام برجام به وقوع پیوست و بازار دو روز پس از توافق و بعد از چند روز مثبت, مسیر نزولی را طی کرد. البته در آن دوران, افت نرخ ارز, افزایش نرخ سود و شرایط خاص اقتصاد کشور در وضعیت آن روزها موثر بود. از سوی دیگر, ترس نرخ ارز همیشه با بازار همراه بوده است؛ بخشی از جریان اتفاقات بازار ناشی از همین موضوع نرخ ارز است که بازار توانایی وزن دادن به تحولات نرخ ارز و پیش بینی از آینده را ندارد و با بدترین سناریو آن را لحاظ می کند. یعنی چون نمی تواند این موضوع را ببیند, بدترین رویدادها را لحاظ می کند در گزارش بازار دیروز عرض کردیم اگر واقعاً کسی فکر می کند دلار مثلا زیر 40 یا حتی حوالی 42 هزار تومان می آید, بهتر است به استراتژی خود که فروش و صبرکردن است, پایبند باشد. اما معتقدیم نوع خبرها نیز نشان می دهد که توافق, توافقی موقت و جریان دسترسی به ارز, جریان غیرنقدی است. البته اثرات روانی آن بر بازار روشن و ملموس خواهد بود. معتقدیم در میان مدت و بلند مدت, بازار نباید از جریان نرخ ارز نگرانی داشته باشد. اتفاقاً ما موافق افزایش نرخ نیستیم. حتی ثبات در این قیمت ها و شرایط و نزدیک شدن نرخ نیما به نرخ معاملاتی, بهترین و مناسب ترین سناریو است که می تواند رخ دهد و بازار سرمایه را رونق ببخشد. اما آنچه فعلا تصمیم می گیرد, هیجان و ترس و استرس ریزش است ترس دیگر بازار, ترس از رکود است؛ رکوردی که دامن گیر صنایع و شرکت ها شود و فضا را به سمت کم حجم و بی حجم بکشاند. با توجه به نقدینگی فعلی و اتفاقات رخ داده, رکود سایر بازارها بیشتر محتمل است تا بازار سرمایه. فکر می کنیم این موضوع نه اینکه از بازار دور باشد, اما به عنوان سناریوی ترسناک برای بازار مطرح نمی شود. برخی دیگر از ترس لنگ در هوا بودن, یک روز بودن, یک روز نبودن, یک روز شادی و یک روز غم,ریسک بزرگی می بینند که بازار هم به خبرها شرطی شود. شاید این یکی از درست ترین چالش ها باشد. بازاری که نمی داند در کدام مسیر حرکت کند. سیاست های اقتصادی روشن نیست, تحولات سیاسی در تایید و تکذیب است و موارد این چنینی و این لنگ در هوا بودن باعث تماشاچی شدن بخشی از جریان پول می شود. شاید بین تمامی این عوامل, این موضوع بیشتر به چشم بیاید, اما فعلا همه از ارز می ترسند شاید بتوان ترس های دیگری را نیز به این موضوع اضافه کرد, اما بهتر است کمی هم از ابزارهای تاریخی کمک بگیریم. بازار هرگاه به ترس بیشتر از ریسک بها داده, نتایج عجیب و تلخ رقم خورده است. شبیه این اتفاقات با درجه کمی بیشتر در آبان ماه رخ داد؛ در جایی که فشار تحولات سیاسی بالا و درجه التهاب جامعه روی 100 بود. در آن فضا, بازار می فروخت و چشم خود را بسته بود و از ترس به سراغ هیچ گزینه ای نمی رفت. اگر وقت داشتید, به نمودار یک ساله قیمت ها نگاه کنید و ببینید که در آبان ماه, قیمت ها در چه فضا و چه شرایطی قرار داشتند و با سودهای محقق شده مقایسه کنیم. این رویداد با تاکید می گوییم با درجه کمتر در مقطع فعلی در حال وقوع است و به زودی با انتشار گزارش ها, قیمت ها کنار این گزارش ها قرار می گیرند و قضاوت می شوند.", "label": "منفی"}
{"id": 82999, "date": "2022-06-27T11:54:44", "text": ",در پایان معاملات نماد معاملاتی شرکت های توسعه صنایع بهشهر وبشهر جهت برگزاری مجمع عادی سالیانه بمنظور تصویب صورت های مالی, سرمایه گذاری توسعه صنعت و تجارت وصنعت جهت برگزاری مجمع عمومی فوق العاده بمنظور انتخاب اعضای هیئت مدیره, تولید محور خودرو خمحور,پتروشیمی شازند شاراک جهت برگزاری مجامع عادی سالیانه بمنظور تصویب صورت های مالی و عمومی فوق العاده, متوقف خواهند شد.", "label": "منفی"}
{"id": 91127, "date": "2022-07-09T11:40:28", "text": ",در پایان معاملات نماد معاملاتی شرکت های تولیدی لنت ترمز ایران خلنت ,سرمایه گذاری صنعت نفت ونفت ,صنعتی سپنتا فپنتا ,گروه سرمایه گذاری سایپا وساپا ,تاید واتر خاورمیانه حتاید ,گروه صنعتی سپاهان فسپا جهت برگزاری مجمع عادی سالیانه به منظور تصویب صورت های مالی متوقف خواهند شد", "label": "منفی"}
{"id": 109087, "date": "2022-08-10T08:27:39", "text": ",روز انتشار داده های مهم تورم شاخص بهای مصرف کننده است. در مهمترین رویداد تقویم این هفته تورم آمریکا را خواهیم داشت و پیش از آن داده های تورم چین و المان منتشر می شوند.", "label": "خنثی"}
{"id": 155492, "date": "2022-11-21T09:04:55", "text": ",روز بسیار بزرگی برای بازار سرمایه است برای حذف قیمت گذاری دستوری برای سرمایه گذاران برای سهامداران برای قطع ید رانتخواران", "label": "مثبت"}
{"id": 187037, "date": "2023-01-25T07:28:07", "text": ",عرضه گواهی سپرده کالایی ربع سکه با حراج قیمتی آزاد پ.ن حراج قیمتی آزاد روش کاملا درستی است و هر کسی هر قیمتی دوست داشت بخرد مثل ربع سکه دیروز که برخی 14 میلیون خریدند برخی هم 7.9 میلیون تومان هیچ کسی حق دخالت در تعیین قیمت را ندارد غیر از خریدار و مشتری و عرضه و تقاضا هرجا قیمت گذاری مقطوع و دستوری شد بدانید فقط و فقط دلالان پشت داستان بوده اند و لاغیر", "label": "مثبت"}
{"id": 55236, "date": "2022-05-16T11:14:30", "text": ",نماد معاملاتی شرکت انتقال داده های آسیاتک اسیاتک با توجه به انتشار اطلاعات حاصل از برگزاری کنفرانس اطلاع رسانی در تارنمای کدال در خصوص تغییرات بیش از 50 درصدی قیمت سهام با شماره پیگیری 881793 ,با محدودیت نوسان قیمت آماده انجام معامله می باشد.", "label": "خنثی"}
{"id": 88769, "date": "2022-07-06T08:56:55", "text": ",نماد معاملاتی شرکت تکنوتار تکنو مشمول دستورالعمل رفع گره معاملاتی می باشد نمادهای معاملاتی دتهران1, شتهران1, کورز1, تفیرو1 و کهرام1 چهارشنبه مشمول رفع گره معاملاتی می باشند", "label": "منفی"}
{"id": 72129, "date": "2022-06-11T09:26:24", "text": ",نماد معاملاتی شرکت های بهساز کاشانه تهران ثبهساز,بیمه ملت ملت,البرز دارو دالبر,گروه دارویی البرز والبر با توجه به افشای اطلاعات با اهمیت گروه ب با محدودیت نوسان قیمت آماده انجام معامله می باشند", "label": "خنثی"}
{"id": 97709, "date": "2022-07-19T09:36:47", "text": ",نماد معاملاتی شرکت های داروسازی امین دامین,پارس دارو دپارس,داروسازی زهراوی دزهراوی,دارویی و بهداشتی لقمان دلقما,صنایع ریخته گری ایران خریخت با توجه به افشای اطلاعات با اهمیت گروه الف,بدون محدودیت نوسان قیمت با استفاده از مکانیزم حراج آماده انجام معامله می باشند. نماد معاملاتی شرکت های معدنی و صنعتی گل گهر کگل,پتروشیمی نوری نوری,بیمه آسیا آسیا,ایرکا پارت صنعت خکار,گروه صنعتی سپاهان فسپا,آبسال لابسا باتوجه به عدم کشف قیمت در روز معاملاتی قبل بدون محدودیت نوسان قیمت با استفاده از مکانیزم حراج آماده انجام معامله می باشند نماد معاملاتی شرکت های لابراتوارداروسازی دکترعبیدی دعبید,فرآورده های تزریقی ایران دفرا,لنت ترمزایران خلنت,فولاد خوزستان فخوز,البرزدارو دالبر و حق تقدم استفاده نشده شرکت البرزدارو دالبرح باتوجه به عدم کشف قیمت در روز معاملاتی قبل بدون محدودیت نوسان قیمت با استفاده از مکانیزم حراج آماده انجام معامله می باشند", "label": "خنثی"}
{"id": 78897, "date": "2022-06-21T09:35:42", "text": ",نماد معاملاتی شرکت های زامیاد خزامیا,فروسیلیس ایران فروس با توجه به افشای اطلاعات با اهمیت گروه الف,بدون محدودیت نوسان قیمت با استفاده از مکانیزم حراج آماده انجام معامله می باشند. هم چنین ضروری است سرمایه گذاران محترم علاوه بر توجه به این موضوع, اطلاعات منتشره شده بر روی تارنمای کدال codal و سایر عوامل موثر بر قیمت سهام را در تصمیم گیری های خود لحاظ نمایند", "label": "خنثی"}
{"id": 230807, "date": "2023-05-31T21:28:23", "text": "- در مورد تأسیسات مریوان, در گذشته یک معدن اورانیوم در این منطقه فعالیت داشته است. که ایرانی ها مدعی هستند کشور خارجی آن را اداره می کرده است. فعالیت این تاسیسات به سال های سلطنت پهلوی باز می گردد. ایرانی ها در مورد بقایای اورانیومی که در آزمایشگاهی که احتمالاً در آن زمان آنجا بود توضیح دادند. در بخشی از این آزمایش ها, بقایای اورانیوم فرآوری شده در میدان رها شده است. پاسخ آژانس کوتاه و دقیق بود - قطعاً ممکن است و پرونده بسته شد. - در مورد بقایای اورانیوم تا سطح 84 درصد در تأسیسات فردو, ایران توضیح داد که خطای کالیبراسیون سانتریفیوژها باعث انحراف شده است. در متن گزارش آژانس آمده است ما متوجه شدیم که هیچ تناقضی بین توضیحات ایران و یافته های ما وجود ندارد . 2127l", "label": "خنثی"}
{"id": 116024, "date": "2022-08-23T07:37:59", "text": ". اگر جریان غذا را کنترل کنید, یک ملت را کنترل می کنید. اگر جریان انرژی را کنترل کنید, یک منطقه را کنترل می کنید. اگر جریان پول را کنترل کنید, جهان را کنترل می کنید. henry a. kissinger", "label": "خنثی"}
{"id": 80961, "date": "2022-06-25T15:57:54", "text": ". بورل مذاکرات درباره برجام را در روزهای آتی از سر می گیریم مسئول سیاست خارجی اتحادیه اروپا سفر من به تهران یک هدف اصلی دارد؛ این که بن بست را بشکنم و تنش ها را درباره مذاکرات برجام کم کنم و این که یک انگیزه و فرصت جدیدی ایجاد کنیم که گفت وگوها را روی ریل قرار دهیم. قرار است مذاکرات را در روزهای آتی از سر بگیریم و این بن بست را بشکنیم. سه ماه گذشته و باید کار را تسریع کنیم. خیلی خوشحالم بابت این تصمیم که ایران گرفت و این تصمیم در تهران و واشنگتن گرفته شده است. قرار است بعد از سفر من مذاکره ادامه یابد و تیم من به عنوان تسهیل گر خواهند بود.", "label": "مثبت"}
{"id": 368518, "date": "2024-04-07T15:01:23", "text": ".اما اگر به خاطر داشته باشی روزهای قبل از سال,مدام از چند خبر و چند عامل صحبت می کردیم که می توانند با بروز و وقوع خود تحولات بازار را دستخوش تغییرات جدی نمایند که این پنج تحول از دید ما در حال حاضر نیز وجود دارند که البته یکی از آنها یعنی نرخ تسعیر بانک ها به بهترین شکل ممکن و در بدترین زمان ممکن اعلام شد که شاید اگر در یک شرایط عادی این عدد اعلام میشد صفوف خرید خاص ترو بهتری داشتیم که باز این هم از بدشانسی سهامداران است اما در هر صورت 4 عامل دیگر یعنی تحولات نرخ دلار و نرخ دلار نیما,خبرهای خاص گروه پالایش و فرمول جدید آن ,خبرهای گروه خودرو و سران قوا و تصمیمات تجدیدی و در نهایت گزارش های 12 ماهه احتمالی پیش رو می توانند 5 عاملی باشند که فضای متفاوتی را برای ارزندگی بازار رقم بزنند و این موضوع به زودی خود را در بازار نیز نشان می دهد و معتقدیم بروز هر یک گام بلندی در حرکت جریان پول به سمت بازار است که نمونه آن را در حجم معاملات بانکی ها شاهد بودیم و کلیت بازار هم با همین نیمچه خبر بانکی ها بهبود داشت این موارد را نوشتیم و تا دراین سیاهی عوامل منفی و ترس برخی بگوییم در عین ریزش و سرخی بازار,نسبت به جریان ارزندگی نمی توان ناامید شد بازار خبرهای خوبی در دل خود دارد که به موقع اگر بروز می کند و اگر کمی فقط کمی تحولات سیاسی و تصمیمات دولت آرام بگیرد قابلیت رشد بازار جدی ست و این موضوع در نمودارها و تحولات نموداری نیز روشن و آشکار است البته به زودی بازار متوجه این موضوع خواهد شد که بیش از اندازه به جریان سیاسی وزن داده و آنقدر که تحلیلگران تلگرامی و بورسی نگران موضوع جنگ بودند احتمالاً فرماندهان نظامی و سیاستمداران نبودند و این دقیقاً اتفاقی است که برای سه الی چهارمین بار طی چند ماه گذشته تکرار می شود و تا حدودی ترس ویژه بازار و عمق کم تحلیل سیاسی فعالان آن را در چنین مواردی نشان می دهد و البته بار دیگر لزوم تشکیل یک نیروی واکنش سریع بورسی را می رساند که در چنین مواقعی با قدرت وارد کارزار شده و جو موجود را کنترل نماید و اما حرف آخر گزارش بازار بار دیگر در مورد موضوع و مبحث بسیار مهم دلار نیما صحبت میکنیم که معتقدیم این رویداد آنقدر آش شوری شده که صدای همه را درآورده و همه مشغول انتقاد و نامه نگاری و زیر سوال بردن این جریان هستند . قبل از بیان این موارد یک نکته را عرض کنیم خیلی پیش بینی این اتفاقاتی که رخ می دهد سخت نبود وقتی تراز تجاری به طرز بی سابقه ای کاهش پیدا می کند نرخ صادرات سرکوب می شود بازار های غیر رسمی به رسمیت شناخته نشده و دولت سعی در سرکوب همه نرخ های واقعی و جنگیدن با اصل بازار را دارد خیلی زود انرژی او به پایان رسیده و درست همان اتفاقی رخ می دهد که باید رخ دهد یعنی جریان واقعی بازار پیروز شده و یک بار دیگر به این سیاستمداران تهی مغز می فهماند که بازار شوخی ندارد و هرجا سعی شده مقابل بازار گارد بگیرند و قواعد و رفتار من درآوردی را جای اصول درست اقتصادی جا بزنند دست نامرئی اقتصاد چنان سیلی به صورت آنها می زند که درد و سوز آن از همیشه بیشتر است موضوع دلار نیما اتفاقی بود که تقریباً تمامی دلسوزان واقعی اقتصاد و کشور نسبت به آن صحبت کردند و هشدار دادند اما کو گوش شنوا دقت کنید در سال 1402معادل 3500 هزار میلیارد تومان به عدد خوب دقت کنید 3500 هزار میلیارد تومان رانت ارزی از طریق اختلاف نرخ سامانه نیما و نرخ آزاد از جیب تولیدکنندگان و صادرکنندگان به جیب واردکنندگان و دلالان پخش شد عددی معادل 4 برابر درامد نفت . یک بار این عدد را بخوانید عددی که به بهانه کنترل تورم از جیب صادرکنندگان و شرکت ها زده شد و به جیب دلالان و وارد کنندگان ریخته شد تا نتیجه چه باشد ؟؟ کنترل تورم ؟ بله درست حدس زدید تمام کالاهایی که وارد شد نعل به نعل با نرخ ارز بازار آزاد به مردم فروخته شد تا این میان بزرگترین خورد و خوراک رانتیون از اختلاف ارزی دوباره رخ دهد و برخی از ما بهتران سفره های مردم را خالی و سفره های خود را رنگین کنند وقتی با صدای بلند فریاد می زدیم که طرفداران نرخ ارز ترجیحی جز این سه دسته هستند بسیاری انتقاد می کردند ولی باز هم تکرار می کنیم کسانی که از نرخ ارز ترجیحی دفاع می کنند و به نوعی این سیستم را قبول دارند و اجرا می کنند از چند حال خارج نیستند یا نادانند و هیچ چیز نمی فهمند که فکر می کنیم کم کم به این نادانی خود واقف شده و در حال تصمیم گیری درست هستند یا دست در دست دلالان و وارد کنندگان دارند و نون در خون این مردم می زنند و با شعارهای پوپولیستی سعی در پیشبرد اهداف این دلالان را دارند و یا جاسوس و دشمن این اقتصاد و مردم هستند که با تصمیمات اشتباه فشار و درد تحولات را مضاعف می کنند", "label": "منفی"}
{"id": 386919, "date": "2024-05-06T13:30:25", "text": "0 نفر مشکوک به استفاده از اطلاعات نهانی بودند عیوضلو معاون نظارت بر بورس ها و ناشران برای معاملات آن روزها, ما افراد و اشخاص و آی پی افرادی که دارنده اطلاعات نهانی بودند را بررسی کردیم. لیست افرادی که بیشترین فروش را داشتند بررسی شد و بالغ بر 2400 شخص حقیقی و حقوقی رسیدیم و بعد از فیلترهای مختلف به لیست 500 نفره رسیدیم و با بررسی الگوی معاملاتی اشخاص که بیشترین فروش را داشتند در نهایت به لیست 40 نفره رسیدیم که مشکوک به استفاده از اطلاعات نهانی بودند. اطلاعات این 40کد به دادسرا ارسال شد.", "label": "منفی"}
{"id": 344533, "date": "2024-03-20T06:35:53", "text": "1 4 0 3 این روزها, زمانی است برای فراهم آمدن اتحاد, شادمانی و امید به آینده. امیدواریم که در سال جدید, با وجود چالش ها و موانعی که پیش روی ما قرار دارد, بتوانیم با همت و اراده, به رسیدن به اهداف خود بپردازیم. سال جدید برای شما پر از سلامتی و پیشرفت باشد. و در این روزهای نوروزی, تمامی اقشار جامعه احساس رفاه و رونق اقتصادی کنند و همگی بهره مند از فرصت های ایجاد شده در کنار هم باشند. این نور و نویدی که با ورود بهار فرا رسیده, همواره در زندگی شما برقرار باشد. با آرزوی موفقیت و سعادت برای همه, عیدتان مبارک", "label": "خنثی"}
{"id": 152452, "date": "2022-11-03T10:12:45", "text": "1 تا 2 میلیون بشکه از نفت روسیه از بازار حذف می شود بر اساس نظرسنجی که رویترز منشتر کرده است با تصویب قانون تعیین سقف قیمت برای نفت روسیه این کشور بخش مهمی از تولید نفت خود را به شرق منتقل کرده است و این کار عملا تاثیری بر جریان تجارت نفت روسیه و جهان نداشته است. بر اساس این نظرسنجی طیف متفاوتی از ارقام توسط محاسبه شوندگان اعلام شده است که از کم شدن ناگهانی 2 میلیون بشکه تا تغییر صفر را شامل می شود. یک کارشناس ارشد انرژی به رویترز می گوید نفت روسیه در بلندمدت خریداران دیگری در آسیا خواهد یافت, اما با اجرایی شدن تعیین سقف قیمت احتمالا 1.5 تا 2 میلیون بشکه در کوتاه مدت از عرضه بازار کاسته خواهد شد . غول تجارت کمودیتیز جهان, ویتول پیش بینی کرده است کاهش عرضه از سمت روسیه 1 میلیون بشکه خواهد بود. از طرفی تحلیلگران بانک نوا اسکوشا معتقدند هیچ تغییر محسوسی در کار نخواهد بود. همچنین یک مقام وزارت خزانه داری ایالات متحده می گوید با وضع محدودیت گروه کشورهای نفت همچنان 80 تا 90 درصد نفت روسیه جریان خواهد داشت اما ما بین 1 تا 2 میلیون بشکه از بازار حذف می شود. کشورهای عضو گروه 7 در ماه جاری تصویب کردند که با اعمال سقف قیمت, احتمالا میان 60 تا 65 دلار برای نفت روسیه علاوه بر قطع نکردن جریان کامل آن از درآمدهای نفتی روسیه بکاهند. بسیاری از ناظران تاثیر چنین کاری را ناچیز و آن را غیر عملی عنوان کرده اند. ", "label": "منفی"}
{"id": 267959, "date": "2023-09-03T20:54:08", "text": "1 میلیون و 60 هزار نفر ارز اربعین گرفتند تازه ترین آمار بانک مرکزی بیانگر آن است که تاکنون یک میلیون و شصت هزار زائر ارز اربعین خود را از شعب 6 بانک عامل تهیه کرده اند. دریافت ارز اربعین به میزان 200 هزار دینار عراق از طریق بانک های عامل مقدور شده و دیگر مانند سال های قبل شاهد تشکیل صف مقابل صرافی ها و افزایش قیمت دینار در بازار آزاد نبودیم. فروش ارز به زائرین بالای 5 سال تا تاریخ ادامه خواهد داشت.", "label": "خنثی"}
{"id": 115526, "date": "2022-08-22T13:02:00", "text": "1.3 میلیون دلار سبزی و صیفی در یک سال گذشته صادر شد در یک سالگی عمر دولت سیزدهم بیش از 4.5 میلیون تن سبزی و صیفی با ارزآوری 1.3 میلیون دلاری صادر شده است. از دلایل افزایش صادرات سبزی و صیفی در یک سال گذشته رفع مشکلات زیرساختی صادراتی این محصولات است. برای صادرات زمینی محصولات کشاورزی به روسیه به کانتینر های دو حالته سرد و گرم نیاز داشتیم تا محصولات کشاورزی در طول مسیر دچار یخ زدگی و گرمازدگی نشود.", "label": "خنثی"}
{"id": 73709, "date": "2022-06-13T20:55:32", "text": "1.5 میلیون یورو توسط صادرکنندگان به بازار عرضه شد دبیر کل شورای عالی کانون صرافان از روز گذشته شاهد متوقف شدن افزایش قیمت ارز بودیم و در 24 ساعت اخیر ارز از کانال 33 هزار تومان به کانال 32 هزار تومان وارد شده و خریداران بازار نسبت به روز گذشته کاهش یافته است و در واقع خریداران به نظاره گران بازار تبدیل شده اند. تا ساعت 12, به غیر از ارز عرضه شده در بازار متشکل ارزی, 1.5 میلیون یورو ارز حاصل از صادرات توسط صادرکنندگان عرضه شده که فقط 500 هزار یورو تقاضا برای آن وجود داشته و منجر به خرید شده است. این نشان می دهد عرضه ارز توسط صادرکنندگان از تقاضای ارز پیشی گرفته و قیمت ها نزولی شده است.", "label": "منفی"}
{"id": 76470, "date": "2022-06-18T10:45:40", "text": "1.6 میلیارد دلار از بدهی عراق به ایران پرداخت شد یحیی آل اسحاق؛ رئیس اتاق بازرگانی مشترک ایران و عراق مطالبات ایران از عراق, بدهی است که این کشور در مقابل دریافت انرژی باید بپردازد که از سوی وزارت نیرو و بانک مرکزی پیگیری می شود. یک میلیارد و 600 میلیون دلار از پول های ایران آزادسازی شده است. بانک مرکزی باید تصمیم بگیرد که این مبلغ به صورت نقدی وارد کشور شود یا بابت خرید کالاهای وارداتی به کشورهای ثالث به صورت حواله پرداخت شود.", "label": "مثبت"}
{"id": 384866, "date": "2024-04-28T13:10:43", "text": "1.8 میلیارد دلار طلا به کشور وارد شد رئیس سازمان توسعه تجارت حدود 1.8 میلیارد دلار طلا در سال گذشته به کشور وارد شده که بیشتر این واردات برای رفع تعهد ارزی بوده است. برخی از منابع بلوکه شده ایران نیز آزاد شده است و برای تامین منابع اولیه در اختیار صنایع قرار گرفته است.", "label": "مثبت"}
{"id": 96861, "date": "2022-07-17T14:41:48", "text": "1.9 میلیون سهامدار عدالت, شماره شبا معتبر برای دریافت سود معرفی نکرده اند حسنلو؛ معاون فناوری اطلاعات شرکت سپرده گذاری مرکزی تاکنون از قریب به یک میلیون و 900 هزار نفر از سهامداران سهام عدالت, اطلاعات معتبر به ویژه شماره شبای معتبر نداریم تا بتوانیم سودی برایشان واریز کنیم. سهامداران می توانند در سامانه جامع اطلاعات مشتریان سجام ثبت نام و بعد از آن احراز هویت کنند تا پس از راستی آزمایی اطلاعات, امکان واریز سود فراهم شود. مبلغ سود سهام عدالت 532 هزار تومانی مربوط به عملکرد سال سال 98 حدود 190 هزار تومان و برای عملکرد سال 99 حدود 582 هزار تومان است.", "label": "منفی"}
{"id": 182383, "date": "2023-01-07T20:20:14", "text": "1.. هزار نفر از بانک صادرات ایران وام ازدواج دریافت کردند بانک صادرات ایران از ابتدای امسال تا نیمه دی ماه نزدیک به 1.. هزار فقره وام قرض الحسنه ازدواج و تهیه جهیزیه پرداخت کرد. از ابتدای سال جاری تا نیمه دی ماه حجم پرداخت این وام از 135 هزار میلیارد ریال فراتر رفت و 99 هزار و 335 نفر از این وام بهره مند شدند. 000bkj", "label": "خنثی"}
{"id": 372447, "date": "2024-04-22T17:57:24", "text": "1.سیستم ارز ترجیحی مکانیزم کوتاه مدت است و از ابتدا باید به فکر حذفش باشید. 2.طبق تحقیقات خود بانک مرکزی این سیستم فقط در 5 قلم کالا اثر بخش هست. 3.اثربخشی در همان پنج قلم هم بسیار سخت است بخاطر ماهیت ارزها و تبدیل آن ها. 4. بخاطر گپ بسیار بالا همه پشت در نیما صف کشیدند و انقدر فرایند تخصیص کند است و تقاضای تجاری در بازار آزاد دارد فشار می آورد. 5. این سیستم ناقص الخلقه را هرچه زودتر اصلاح کنید بیش واکنشی را کمتر می کنید. 6.در عجبم که چرا دست بر نمیدارید؟", "label": "منفی"}
{"id": 28143, "date": "2022-04-03T12:57:20", "text": "2 اتفاق خوب در بازار ارزش معاملات خرد و ورود پول حقیقی که به شرط ادامه دار بودن, نوید بخش روزهای خوبی برای بازار است.", "label": "مثبت"}
{"id": 226040, "date": "2023-05-15T15:30:50", "text": "2 اقدام مهم بانک مرکزی برای بهبود فرایند تخصیص ارز بانک مرکزی از یک سو فرایند تخصیص ارز را کوتاه تر کرده و از طرفی برخورد جدی با فساد های احتمالی را در دستور کار قرار داده است. جزئیات 2 اقدام مهم بانک مرکزی برای بهبود فرایند تخصیص ارز را اینجا بخوانید.", "label": "مثبت"}
{"id": 244115, "date": "2023-07-13T22:47:18", "text": "2 اقدام مهم بانک مرکزی برای تسهیل پرداخت تسهیلات خرد مهدی رزمی؛ معاون اعتبارات بانک صادرات افزایش میزان تسهیلات خرد از 200 به 500 میلیون تومان و ارسال بخشنامه های تاکیدی درخصوص تسهیل گری در پرداخت و اخذ ضامن برای تسهیلات خرد, 2 اقدام مهم بانک مرکزی است. سیاست گذار پولی همچنین تنبیهاتی برای بانک هایی که از این موضوع سرپیچی می کنند, در نظر گرفته است.", "label": "منفی"}
{"id": 331048, "date": "2024-02-06T11:21:27", "text": "2 بانک انگلیسی اتهام دور زدن تحریم های آمریکا علیه ایران را رد کردند دو بانک انگلیسی لویدز و سانتاندر پس از انتشار گزارش روز گذشته روزنامه فایننشال تایمز مبنی بر ارائه حساب های بانکی به شرکت های هلدینگ انگلیسی مرتبط با یک شرکت پتروشیمی تحت حمایت ایران, آن را رد و تاکید کردند که فعالیت های آنها موجب نقض تحریم های آمریکا نشده است. ایسنا", "label": "    خنثی"}
{"id": 304887, "date": "2023-11-08T16:32:20", "text": "2 بانک به فرایند انتقال سهام عدالت متوفیان به وراث اضافه شدند شرکت سپرده گذاری مرکزی اوراق بهادار و تسویه وجوه با صدور اطلاعیه ای از اضافه شدن 2 بانک ملت و پارسیان به فرایند انتقال سهام عدالت متوفیان به وراث خبر داد.", "label": "خنثی"}
{"id": 216855, "date": "2023-04-15T11:50:52", "text": "2 بانک عامل فروش ارز مسافرتی شدند بانک ملت هم عامل فروش ارز مسافرتی شد مسعود توکلی؛ معاون مرکز مبادله ایران شعب منتخب ارزی بانک ملت هم مانند بانک ملی نسبت به فروش ارز مسافرتی اقدام می کنند و متقاضیان ارز مسافرتی می توانند به این شعب نیز مراجعه کنند. متقاضیان خرید ارز مسافرتی با مراجعه به شعب ارزی اعلام شده از سوی این بانک ها, در ازای پرداخت معادل ریال ارز مسافرتی, رسیدی را دریافت می کنند که باید آن را در فرودگاه تحویل باجه های ارزی بدهند و ارز خریداری شده را دریافت کنند. هم اکنون هر دو بانک ملی و ملت در فرودگاه ها باجه های ارزی و خودپرداز های ارزی دارند که مسافران می توانند از این طریق نسبت به دریافت ارز خود اقدام کنند. طبق تصمیم بانک مرکزی؛ برای مسافرت های زمینی 300 یورو و مسافرت های هوایی 500 یورو اختصاص داده شده است؛ ارز مسافرتی در پشت گیت فرودگاه ها به مسافران تحویل داده خواهد شد. 000cmp", "label": "منفی\n"}
{"id": 237123, "date": "2023-06-26T10:25:49", "text": "2 بسیاری از تحلیل گران به شاخص pmi شاخص مدیران خرید برای ارزیابی شرایط اقتصادی توجه میکنند . اگر شاخص pmi را از تورم کم کنیم میتوان به معیاری خوبی برای پیش بینی رفتار مارکت برسیم. ایمان درستیان", "label": "خنثی"}
{"id": 398925, "date": "2024-06-17T23:35:19", "text": "2 تا چالش الان داریم محدودیت دامنه نوسان منتخب ریاست جمهوری بین 3 تا نامزد اصلی میشه گفت شانس هر کدوم برای انتخاب شدن حدود 30 درصد هست,ترس بازار از جلیلی هست که بعد از انتخاب شدن بازار واکنش منفی هیجانب در کوتاه مدت داره اما با دو نامزد دیگه حداقل در کوتاه مدت بعد از انتخاب شدن کف بازار پایین تر انتظار نمیره در نتیجه با این ریسک به ریوارد بازار منتظر یه محرک و مجوز برای واکنش هست و از این منظر از نظر زمانی این رویداد میتونه نزدیک باشه و باید بازار بیشتر از روز های گذشته واچ کرد و زمان فروش تو این تایم نیست یه سری سرعت گیر هم داریم مثل نرخ بهره که شواهد نشون میده از اوج فاصله گرفته و همین محدوده 30 مدتی فیکس میشه تایمینگ شاخص ها هم دیده بشه از کل هم وزن شاخص قیمت و هم تاییدیه هایی برای کوتاه مدت داره میده منتظریم و امیدواریم به بهبود نسبی کانال sna zade", "label": "خنثی"}
{"id": 234792, "date": "2023-06-19T21:06:15", "text": "2 تصور غلط درباره ارز 28500 ارز پتروشیمی ها و فولادی ها 38 تا 41 هزارتومان خریداری می شود اصغر بالسینی؛ کارشناس بازار پول و ارز همانگونه که رئیس کل بانک مرکزی بیان کردند می توان گفت که ارز 28500 با 4200 با هم قابل مقایسه نیست. ارز 28500 تومانی را بانک مرکزی با نرخ 27500 تومان از دولت خریداری می کند و با 1000 تومان بالاتر به فروش می رساند. بنابراین تغییری در متغیر پایه پولی رخ نمی دهد. ارز 28500 تومانی صرفا ارزی است که دولت از طریق فروش نفت و گاز در اختیار دارد و به بانک مرکزی می فروشد. مابقی ارزها شامل ارز پتروشیمی ها, فولادی ها و صادرکنندگان غیر نفتی با نرخ حواله 38 هزار تومانی و اسکناس آن ها هم با نرخ 41 هزار تومانی به فروش می رسد.", "label": "منفی"}
{"id": 184667, "date": "2023-01-17T14:26:46", "text": "2 خودروساز خواستار ادامه عرضه خودرو در بورس مدیرعامل ایران خودرو و سایپا با ارسال نامه هایی به سازمان بورس و اوراق بهادار خواستار ادامه عرضه خودرو در بورس کالا شدند.", "label": "مثبت"}
{"id": 14732, "date": "2022-02-28T16:53:04", "text": "2 درصد از درآمد تراکنش بانک ها به خزانه واریز می شود بانک ها و موسسات اعتباری را موظف شدند, 2 درصد از درآمد حاصل از تراکنش ها را در نظام بانکداری الکترونیک به خزانه داری کل کشور واریز نمایند. در بند الحاقی 4 تبصره 10 ماده واحده لایحه آمده است کلیه بانک ها و موسسات اعتباری موظفند 2 درصد از درآمد حاصل از هزینه های دریافتی بابت تراکنش ها بدون افزایش آنها نسبت به سال 1400 در نظام بانکداری الکترونیکی را به ردیف 160 164 نزد خزانه داری کل کشور واریز نمایند.", "label": "منفی"}
{"id": 104646, "date": "2022-07-28T10:28:55", "text": "2 دستور آیت الله رئیسی برای امدادرسانی به سیل زدگان امامزاده داوود رئیس جمهور از استاندار تهران خواست تا تمام امکانات امدادی اعم از هلال احمر, شهرداری و ستاد مدیریت بحران را برای تسریع در عملیات امداد و نجات و نیز تمهید پیش بینی های لازم برای پیشگیری از حوادث مشابه سیل در امامزاده داوود علیه السلام, بسیج کند.", "label": "خنثی"}
{"id": 213912, "date": "2023-03-31T17:33:16", "text": "2 دلیل رشد پایه پولی در سال 1401 اعلام شد بانک مرکزی افزایش اضافه برداشت بانکها و موسسات اعتباری و تامین اعتبارات ارزی مورد نیاز وزارت جهاد کشاورزی و وزارت بهداشت پس از حذف ارز ترجیحی را دو دلیل اصلی افزایش رشد ماهانه پایه پولی در سال 1401 اعلام کرد. پایه پولی در دوازده ماهه منتهی به پایان دی ماه 1401 معادل 38.2 درصد افزایش یافت که نسبت به رشد دوره مشابه سال قبل 35.5 درصد 2.7 واحد درصد افزایش نشان می دهد.", "label": "منفی"}
{"id": 396935, "date": "2024-06-11T14:57:24", "text": "2 راهبرد مهم بانک مرکزی در تامین مالی بنگاه های اقتصادی اصغر ابوالحسنی؛ قائم مقام بانک مرکزی اگر سیاست های تثبیت به درستی اجرا شود, رسیدن به اهداف تورمی را تضمین می کند. ما باید بتوانیم به بخش حقیقی اقتصاد پاسخ بدهیم. نمی توان برای تورم و پایه پولی هدف گذاری کرد اما به بخش واقعی اقتصاد جواب نداد. بانک مرکزی به دنبال استفاده از ابزارهای متعدد و متنوع هدایت اعتبار و استفاده بهینه از ارزهای در دسترس داخل و خارج از کشور است. دولت و بانک مرکزی باید در جهت رسیدن به اهداف مورد نظر ه ماهنگ باشند.", "label": "خنثی"}
